apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_LOWSPEED_CLK_SEL : R/W ;bitpos:[2] ;default: 1'b0 ; */

#define DPORT_LOWSPEED_CLK_SEL  (BIT(2))
#define DPORT_LOWSPEED_CLK_SEL_M  (BIT(2))
#define DPORT_LOWSPEED_CLK_SEL_V  0x1
#define DPORT_LOWSPEED_CLK_SEL_S  2

/* DPORT_CPUPERIOD_SEL : R/W ;bitpos:[1:0] ;default: 2'b0 ; */

#define DPORT_CPUPERIOD_SEL  0x00000003
#define DPORT_CPUPERIOD_SEL_M  ((DPORT_CPUPERIOD_SEL_V)<<(DPORT_CPUPERIOD_SEL_S))
#define DPORT_CPUPERIOD_SEL_V  0x3
#define DPORT_CPUPERIOD_SEL_S  0
#define DPORT_CPUPERIOD_SEL_80  0
#define DPORT_CPUPERIOD_SEL_160 1
#define DPORT_CPUPERIOD_SEL_240	2

#define DPORT_PRO_CACHE_CTRL_REG          (DR_REG_DPORT_BASE + 0x040)

/* DPORT_PRO_DRAM_HL : R/W ;bitpos:[16] ;default: 1'b0 ; */

#define DPORT_PRO_DRAM_HL  (BIT(16))
#define DPORT_PRO_DRAM_HL_M  (BIT(16))
#define DPORT_PRO_DRAM_HL_V  0x1
#define DPORT_PRO_DRAM_HL_S  16

/* DPORT_SLAVE_REQ : RO ;bitpos:[15] ;default: 1'b0 ; */

#define DPORT_SLAVE_REQ  (BIT(15))
#define DPORT_SLAVE_REQ_M  (BIT(15))
#define DPORT_SLAVE_REQ_V  0x1
#define DPORT_SLAVE_REQ_S  15

/* DPORT_AHB_SPI_REQ : RO ;bitpos:[14] ;default: 1'b0 ; */

#define DPORT_AHB_SPI_REQ  (BIT(14))
#define DPORT_AHB_SPI_REQ_M  (BIT(14))
#define DPORT_AHB_SPI_REQ_V  0x1
#define DPORT_AHB_SPI_REQ_S  14

/* DPORT_PRO_SLAVE_REQ : RO ;bitpos:[13] ;default: 1'b0 ; */

#define DPORT_PRO_SLAVE_REQ  (BIT(13))
#define DPORT_PRO_SLAVE_REQ_M  (BIT(13))
#define DPORT_PRO_SLAVE_REQ_V  0x1
#define DPORT_PRO_SLAVE_REQ_S  13

/* DPORT_PRO_AHB_SPI_REQ : RO ;bitpos:[12] ;default: 1'b0 ; */

#define DPORT_PRO_AHB_SPI_REQ  (BIT(12))
#define DPORT_PRO_AHB_SPI_REQ_M  (BIT(12))
#define DPORT_PRO_AHB_SPI_REQ_V  0x1
#define DPORT_PRO_AHB_SPI_REQ_S  12

/* DPORT_PRO_DRAM_SPLIT : R/W ;bitpos:[11] ;default: 1'b0 ; */

#define DPORT_PRO_DRAM_SPLIT  (BIT(11))
#define DPORT_PRO_DRAM_SPLIT_M  (BIT(11))
#define DPORT_PRO_DRAM_SPLIT_V  0x1
#define DPORT_PRO_DRAM_SPLIT_S  11

/* DPORT_PRO_SINGLE_IRAM_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */

#define DPORT_PRO_SINGLE_IRAM_ENA  (BIT(10))
#define DPORT_PRO_SINGLE_IRAM_ENA_M  (BIT(10))
#define DPORT_PRO_SINGLE_IRAM_ENA_V  0x1
#define DPORT_PRO_SINGLE_IRAM_ENA_S  10

/* DPORT_PRO_CACHE_LOCK_3_EN : R/W ;bitpos:[9] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_LOCK_3_EN  (BIT(9))
#define DPORT_PRO_CACHE_LOCK_3_EN_M  (BIT(9))
#define DPORT_PRO_CACHE_LOCK_3_EN_V  0x1
#define DPORT_PRO_CACHE_LOCK_3_EN_S  9

/* DPORT_PRO_CACHE_LOCK_2_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_LOCK_2_EN  (BIT(8))
#define DPORT_PRO_CACHE_LOCK_2_EN_M  (BIT(8))
#define DPORT_PRO_CACHE_LOCK_2_EN_V  0x1
#define DPORT_PRO_CACHE_LOCK_2_EN_S  8

/* DPORT_PRO_CACHE_LOCK_1_EN : R/W ;bitpos:[7] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_LOCK_1_EN  (BIT(7))
#define DPORT_PRO_CACHE_LOCK_1_EN_M  (BIT(7))
#define DPORT_PRO_CACHE_LOCK_1_EN_V  0x1
#define DPORT_PRO_CACHE_LOCK_1_EN_S  7

/* DPORT_PRO_CACHE_LOCK_0_EN : R/W ;bitpos:[6] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_LOCK_0_EN  (BIT(6))
#define DPORT_PRO_CACHE_LOCK_0_EN_M  (BIT(6))
#define DPORT_PRO_CACHE_LOCK_0_EN_V  0x1
#define DPORT_PRO_CACHE_LOCK_0_EN_S  6

/* DPORT_PRO_CACHE_FLUSH_DONE : RO ;bitpos:[5] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_FLUSH_DONE  (BIT(5))
#define DPORT_PRO_CACHE_FLUSH_DONE_M  (BIT(5))
#define DPORT_PRO_CACHE_FLUSH_DONE_V  0x1
#define DPORT_PRO_CACHE_FLUSH_DONE_S  5

/* DPORT_PRO_CACHE_FLUSH_ENA : R/W ;bitpos:[4] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_FLUSH_ENA  (BIT(4))
#define DPORT_PRO_CACHE_FLUSH_ENA_M  (BIT(4))
#define DPORT_PRO_CACHE_FLUSH_ENA_V  0x1
#define DPORT_PRO_CACHE_FLUSH_ENA_S  4

/* DPORT_PRO_CACHE_ENABLE : R/W ;bitpos:[3] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_ENABLE  (BIT(3))
#define DPORT_PRO_CACHE_ENABLE_M  (BIT(3))
#define DPORT_PRO_CACHE_ENABLE_V  0x1
#define DPORT_PRO_CACHE_ENABLE_S  3

/* DPORT_PRO_CACHE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_MODE  (BIT(2))
#define DPORT_PRO_CACHE_MODE_M  (BIT(2))
#define DPORT_PRO_CACHE_MODE_V  0x1
#define DPORT_PRO_CACHE_MODE_S  2

#define DPORT_PRO_CACHE_CTRL1_REG          (DR_REG_DPORT_BASE + 0x044)

/* DPORT_PRO_CACHE_MMU_IA_CLR : R/W ;bitpos:[13] ;default: 1'b0 ; */

#define DPORT_PRO_CACHE_MMU_IA_CLR  (BIT(13))
#define DPORT_PRO_CACHE_MMU_IA_CLR_M  (BIT(13))
#define DPORT_PRO_CACHE_MMU_IA_CLR_V  0x1
#define DPORT_PRO_CACHE_MMU_IA_CLR_S  13

/* DPORT_PRO_CMMU_PD : R/W ;bitpos:[12] ;default: 1'b0 ; */

#define DPORT_PRO_CMMU_PD  (BIT(12))
#define DPORT_PRO_CMMU_PD_M  (BIT(12))
#define DPORT_PRO_CMMU_PD_V  0x1
#define DPORT_PRO_CMMU_PD_S  12

/* DPORT_PRO_CMMU_FORCE_ON : R/W ;bitpos:[11] ;default: 1'b1 ; */

#define DPORT_PRO_CMMU_FORCE_ON  (BIT(11))
#define DPORT_PRO_CMMU_FORCE_ON_M  (BIT(11))
#define DPORT_PRO_CMMU_FORCE_ON_V  0x1
#define DPORT_PRO_CMMU_FORCE_ON_S  11

/* DPORT_PRO_CMMU_FLASH_PAGE_MODE : R/W ;bitpos:[10:9] ;default: 2'b0 ; */

#define DPORT_PRO_CMMU_FLASH_PAGE_MODE  0x00000003
#define DPORT_PRO_CMMU_FLASH_PAGE_MODE_M  ((DPORT_PRO_CMMU_FLASH_PAGE_MODE_V)<<(DPORT_PRO_CMMU_FLASH_PAGE_MODE_S))
#define DPORT_PRO_CMMU_FLASH_PAGE_MODE_V  0x3
#define DPORT_PRO_CMMU_FLASH_PAGE_MODE_S  9

/* DPORT_PRO_CMMU_SRAM_PAGE_MODE : R/W ;bitpos:[8:6] ;default: 3'd3 ; */

#define DPORT_PRO_CMMU_SRAM_PAGE_MODE  0x00000007
#define DPORT_PRO_CMMU_SRAM_PAGE_MODE_M  ((DPORT_PRO_CMMU_SRAM_PAGE_MODE_V)<<(DPORT_PRO_CMMU_SRAM_PAGE_MODE_S))
#define DPORT_PRO_CMMU_SRAM_PAGE_MODE_V  0x7
#define DPORT_PRO_CMMU_SRAM_PAGE_MODE_S  6

/* DPORT_PRO_CACHE_MASK_OPSDRAM : R/W ;bitpos:[5] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_MASK_OPSDRAM  (BIT(5))
#define DPORT_PRO_CACHE_MASK_OPSDRAM_M  (BIT(5))
#define DPORT_PRO_CACHE_MASK_OPSDRAM_V  0x1
#define DPORT_PRO_CACHE_MASK_OPSDRAM_S  5

/* DPORT_PRO_CACHE_MASK_DROM0 : R/W ;bitpos:[4] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_MASK_DROM0  (BIT(4))
#define DPORT_PRO_CACHE_MASK_DROM0_M  (BIT(4))
#define DPORT_PRO_CACHE_MASK_DROM0_V  0x1
#define DPORT_PRO_CACHE_MASK_DROM0_S  4

/* DPORT_PRO_CACHE_MASK_DRAM1 : R/W ;bitpos:[3] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_MASK_DRAM1  (BIT(3))
#define DPORT_PRO_CACHE_MASK_DRAM1_M  (BIT(3))
#define DPORT_PRO_CACHE_MASK_DRAM1_V  0x1
#define DPORT_PRO_CACHE_MASK_DRAM1_S  3

