apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_PRO_CACHE_MASK_IROM0 : R/W ;bitpos:[2] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_MASK_IROM0  (BIT(2))
#define DPORT_PRO_CACHE_MASK_IROM0_M  (BIT(2))
#define DPORT_PRO_CACHE_MASK_IROM0_V  0x1
#define DPORT_PRO_CACHE_MASK_IROM0_S  2

/* DPORT_PRO_CACHE_MASK_IRAM1 : R/W ;bitpos:[1] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_MASK_IRAM1  (BIT(1))
#define DPORT_PRO_CACHE_MASK_IRAM1_M  (BIT(1))
#define DPORT_PRO_CACHE_MASK_IRAM1_V  0x1
#define DPORT_PRO_CACHE_MASK_IRAM1_S  1

/* DPORT_PRO_CACHE_MASK_IRAM0 : R/W ;bitpos:[0] ;default: 1'b1 ; */

#define DPORT_PRO_CACHE_MASK_IRAM0  (BIT(0))
#define DPORT_PRO_CACHE_MASK_IRAM0_M  (BIT(0))
#define DPORT_PRO_CACHE_MASK_IRAM0_V  0x1
#define DPORT_PRO_CACHE_MASK_IRAM0_S  0

#define DPORT_PRO_CACHE_LOCK_0_ADDR_REG          (DR_REG_DPORT_BASE + 0x048)

/* DPORT_PRO_CACHE_LOCK_0_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_0_ADDR_MAX  0x0000000F
#define DPORT_PRO_CACHE_LOCK_0_ADDR_MAX_M  ((DPORT_PRO_CACHE_LOCK_0_ADDR_MAX_V)<<(DPORT_PRO_CACHE_LOCK_0_ADDR_MAX_S))
#define DPORT_PRO_CACHE_LOCK_0_ADDR_MAX_V  0xF
#define DPORT_PRO_CACHE_LOCK_0_ADDR_MAX_S  18

/* DPORT_PRO_CACHE_LOCK_0_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_0_ADDR_MIN  0x0000000F
#define DPORT_PRO_CACHE_LOCK_0_ADDR_MIN_M  ((DPORT_PRO_CACHE_LOCK_0_ADDR_MIN_V)<<(DPORT_PRO_CACHE_LOCK_0_ADDR_MIN_S))
#define DPORT_PRO_CACHE_LOCK_0_ADDR_MIN_V  0xF
#define DPORT_PRO_CACHE_LOCK_0_ADDR_MIN_S  14

/* DPORT_PRO_CACHE_LOCK_0_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_PRO_CACHE_LOCK_0_ADDR_PRE  0x00003FFF
#define DPORT_PRO_CACHE_LOCK_0_ADDR_PRE_M  ((DPORT_PRO_CACHE_LOCK_0_ADDR_PRE_V)<<(DPORT_PRO_CACHE_LOCK_0_ADDR_PRE_S))
#define DPORT_PRO_CACHE_LOCK_0_ADDR_PRE_V  0x3FFF
#define DPORT_PRO_CACHE_LOCK_0_ADDR_PRE_S  0

#define DPORT_PRO_CACHE_LOCK_1_ADDR_REG          (DR_REG_DPORT_BASE + 0x04C)

/* DPORT_PRO_CACHE_LOCK_1_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_1_ADDR_MAX  0x0000000F
#define DPORT_PRO_CACHE_LOCK_1_ADDR_MAX_M  ((DPORT_PRO_CACHE_LOCK_1_ADDR_MAX_V)<<(DPORT_PRO_CACHE_LOCK_1_ADDR_MAX_S))
#define DPORT_PRO_CACHE_LOCK_1_ADDR_MAX_V  0xF
#define DPORT_PRO_CACHE_LOCK_1_ADDR_MAX_S  18

/* DPORT_PRO_CACHE_LOCK_1_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_1_ADDR_MIN  0x0000000F
#define DPORT_PRO_CACHE_LOCK_1_ADDR_MIN_M  ((DPORT_PRO_CACHE_LOCK_1_ADDR_MIN_V)<<(DPORT_PRO_CACHE_LOCK_1_ADDR_MIN_S))
#define DPORT_PRO_CACHE_LOCK_1_ADDR_MIN_V  0xF
#define DPORT_PRO_CACHE_LOCK_1_ADDR_MIN_S  14

/* DPORT_PRO_CACHE_LOCK_1_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_PRO_CACHE_LOCK_1_ADDR_PRE  0x00003FFF
#define DPORT_PRO_CACHE_LOCK_1_ADDR_PRE_M  ((DPORT_PRO_CACHE_LOCK_1_ADDR_PRE_V)<<(DPORT_PRO_CACHE_LOCK_1_ADDR_PRE_S))
#define DPORT_PRO_CACHE_LOCK_1_ADDR_PRE_V  0x3FFF
#define DPORT_PRO_CACHE_LOCK_1_ADDR_PRE_S  0

#define DPORT_PRO_CACHE_LOCK_2_ADDR_REG          (DR_REG_DPORT_BASE + 0x050)

/* DPORT_PRO_CACHE_LOCK_2_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_2_ADDR_MAX  0x0000000F
#define DPORT_PRO_CACHE_LOCK_2_ADDR_MAX_M  ((DPORT_PRO_CACHE_LOCK_2_ADDR_MAX_V)<<(DPORT_PRO_CACHE_LOCK_2_ADDR_MAX_S))
#define DPORT_PRO_CACHE_LOCK_2_ADDR_MAX_V  0xF
#define DPORT_PRO_CACHE_LOCK_2_ADDR_MAX_S  18

/* DPORT_PRO_CACHE_LOCK_2_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_2_ADDR_MIN  0x0000000F
#define DPORT_PRO_CACHE_LOCK_2_ADDR_MIN_M  ((DPORT_PRO_CACHE_LOCK_2_ADDR_MIN_V)<<(DPORT_PRO_CACHE_LOCK_2_ADDR_MIN_S))
#define DPORT_PRO_CACHE_LOCK_2_ADDR_MIN_V  0xF
#define DPORT_PRO_CACHE_LOCK_2_ADDR_MIN_S  14

/* DPORT_PRO_CACHE_LOCK_2_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_PRO_CACHE_LOCK_2_ADDR_PRE  0x00003FFF
#define DPORT_PRO_CACHE_LOCK_2_ADDR_PRE_M  ((DPORT_PRO_CACHE_LOCK_2_ADDR_PRE_V)<<(DPORT_PRO_CACHE_LOCK_2_ADDR_PRE_S))
#define DPORT_PRO_CACHE_LOCK_2_ADDR_PRE_V  0x3FFF
#define DPORT_PRO_CACHE_LOCK_2_ADDR_PRE_S  0

#define DPORT_PRO_CACHE_LOCK_3_ADDR_REG          (DR_REG_DPORT_BASE + 0x054)

/* DPORT_PRO_CACHE_LOCK_3_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_3_ADDR_MAX  0x0000000F
#define DPORT_PRO_CACHE_LOCK_3_ADDR_MAX_M  ((DPORT_PRO_CACHE_LOCK_3_ADDR_MAX_V)<<(DPORT_PRO_CACHE_LOCK_3_ADDR_MAX_S))
#define DPORT_PRO_CACHE_LOCK_3_ADDR_MAX_V  0xF
#define DPORT_PRO_CACHE_LOCK_3_ADDR_MAX_S  18

/* DPORT_PRO_CACHE_LOCK_3_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_PRO_CACHE_LOCK_3_ADDR_MIN  0x0000000F
#define DPORT_PRO_CACHE_LOCK_3_ADDR_MIN_M  ((DPORT_PRO_CACHE_LOCK_3_ADDR_MIN_V)<<(DPORT_PRO_CACHE_LOCK_3_ADDR_MIN_S))
#define DPORT_PRO_CACHE_LOCK_3_ADDR_MIN_V  0xF
#define DPORT_PRO_CACHE_LOCK_3_ADDR_MIN_S  14

/* DPORT_PRO_CACHE_LOCK_3_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_PRO_CACHE_LOCK_3_ADDR_PRE  0x00003FFF
#define DPORT_PRO_CACHE_LOCK_3_ADDR_PRE_M  ((DPORT_PRO_CACHE_LOCK_3_ADDR_PRE_V)<<(DPORT_PRO_CACHE_LOCK_3_ADDR_PRE_S))
#define DPORT_PRO_CACHE_LOCK_3_ADDR_PRE_V  0x3FFF
#define DPORT_PRO_CACHE_LOCK_3_ADDR_PRE_S  0

#define DPORT_APP_CACHE_CTRL_REG          (DR_REG_DPORT_BASE + 0x058)

/* DPORT_APP_DRAM_HL : R/W ;bitpos:[14] ;default: 1'b0 ; */

#define DPORT_APP_DRAM_HL  (BIT(14))
#define DPORT_APP_DRAM_HL_M  (BIT(14))
#define DPORT_APP_DRAM_HL_V  0x1
#define DPORT_APP_DRAM_HL_S  14

/* DPORT_APP_SLAVE_REQ : RO ;bitpos:[13] ;default: 1'b0 ; */

#define DPORT_APP_SLAVE_REQ  (BIT(13))
#define DPORT_APP_SLAVE_REQ_M  (BIT(13))
#define DPORT_APP_SLAVE_REQ_V  0x1
#define DPORT_APP_SLAVE_REQ_S  13

/* DPORT_APP_AHB_SPI_REQ : RO ;bitpos:[12] ;default: 1'b0 ; */

#define DPORT_APP_AHB_SPI_REQ  (BIT(12))
#define DPORT_APP_AHB_SPI_REQ_M  (BIT(12))
#define DPORT_APP_AHB_SPI_REQ_V  0x1
#define DPORT_APP_AHB_SPI_REQ_S  12

/* DPORT_APP_DRAM_SPLIT : R/W ;bitpos:[11] ;default: 1'b0 ; */

#define DPORT_APP_DRAM_SPLIT  (BIT(11))
#define DPORT_APP_DRAM_SPLIT_M  (BIT(11))
#define DPORT_APP_DRAM_SPLIT_V  0x1
#define DPORT_APP_DRAM_SPLIT_S  11

/* DPORT_APP_SINGLE_IRAM_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */

#define DPORT_APP_SINGLE_IRAM_ENA  (BIT(10))
#define DPORT_APP_SINGLE_IRAM_ENA_M  (BIT(10))
#define DPORT_APP_SINGLE_IRAM_ENA_V  0x1
#define DPORT_APP_SINGLE_IRAM_ENA_S  10

/* DPORT_APP_CACHE_LOCK_3_EN : R/W ;bitpos:[9] ;default: 1'b0 ; */

