apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_APP_CACHE_LOCK_3_EN  (BIT(9))
#define DPORT_APP_CACHE_LOCK_3_EN_M  (BIT(9))
#define DPORT_APP_CACHE_LOCK_3_EN_V  0x1
#define DPORT_APP_CACHE_LOCK_3_EN_S  9

/* DPORT_APP_CACHE_LOCK_2_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_LOCK_2_EN  (BIT(8))
#define DPORT_APP_CACHE_LOCK_2_EN_M  (BIT(8))
#define DPORT_APP_CACHE_LOCK_2_EN_V  0x1
#define DPORT_APP_CACHE_LOCK_2_EN_S  8

/* DPORT_APP_CACHE_LOCK_1_EN : R/W ;bitpos:[7] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_LOCK_1_EN  (BIT(7))
#define DPORT_APP_CACHE_LOCK_1_EN_M  (BIT(7))
#define DPORT_APP_CACHE_LOCK_1_EN_V  0x1
#define DPORT_APP_CACHE_LOCK_1_EN_S  7

/* DPORT_APP_CACHE_LOCK_0_EN : R/W ;bitpos:[6] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_LOCK_0_EN  (BIT(6))
#define DPORT_APP_CACHE_LOCK_0_EN_M  (BIT(6))
#define DPORT_APP_CACHE_LOCK_0_EN_V  0x1
#define DPORT_APP_CACHE_LOCK_0_EN_S  6

/* DPORT_APP_CACHE_FLUSH_DONE : RO ;bitpos:[5] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_FLUSH_DONE  (BIT(5))
#define DPORT_APP_CACHE_FLUSH_DONE_M  (BIT(5))
#define DPORT_APP_CACHE_FLUSH_DONE_V  0x1
#define DPORT_APP_CACHE_FLUSH_DONE_S  5

/* DPORT_APP_CACHE_FLUSH_ENA : R/W ;bitpos:[4] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_FLUSH_ENA  (BIT(4))
#define DPORT_APP_CACHE_FLUSH_ENA_M  (BIT(4))
#define DPORT_APP_CACHE_FLUSH_ENA_V  0x1
#define DPORT_APP_CACHE_FLUSH_ENA_S  4

/* DPORT_APP_CACHE_ENABLE : R/W ;bitpos:[3] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_ENABLE  (BIT(3))
#define DPORT_APP_CACHE_ENABLE_M  (BIT(3))
#define DPORT_APP_CACHE_ENABLE_V  0x1
#define DPORT_APP_CACHE_ENABLE_S  3

/* DPORT_APP_CACHE_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_MODE  (BIT(2))
#define DPORT_APP_CACHE_MODE_M  (BIT(2))
#define DPORT_APP_CACHE_MODE_V  0x1
#define DPORT_APP_CACHE_MODE_S  2

#define DPORT_APP_CACHE_CTRL1_REG          (DR_REG_DPORT_BASE + 0x05C)

/* DPORT_APP_CACHE_MMU_IA_CLR : R/W ;bitpos:[13] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_MMU_IA_CLR  (BIT(13))
#define DPORT_APP_CACHE_MMU_IA_CLR_M  (BIT(13))
#define DPORT_APP_CACHE_MMU_IA_CLR_V  0x1
#define DPORT_APP_CACHE_MMU_IA_CLR_S  13

/* DPORT_APP_CMMU_PD : R/W ;bitpos:[12] ;default: 1'b0 ; */

#define DPORT_APP_CMMU_PD  (BIT(12))
#define DPORT_APP_CMMU_PD_M  (BIT(12))
#define DPORT_APP_CMMU_PD_V  0x1
#define DPORT_APP_CMMU_PD_S  12

/* DPORT_APP_CMMU_FORCE_ON : R/W ;bitpos:[11] ;default: 1'b1 ; */

#define DPORT_APP_CMMU_FORCE_ON  (BIT(11))
#define DPORT_APP_CMMU_FORCE_ON_M  (BIT(11))
#define DPORT_APP_CMMU_FORCE_ON_V  0x1
#define DPORT_APP_CMMU_FORCE_ON_S  11

/* DPORT_APP_CMMU_FLASH_PAGE_MODE : R/W ;bitpos:[10:9] ;default: 2'b0 ; */

#define DPORT_APP_CMMU_FLASH_PAGE_MODE  0x00000003
#define DPORT_APP_CMMU_FLASH_PAGE_MODE_M  ((DPORT_APP_CMMU_FLASH_PAGE_MODE_V)<<(DPORT_APP_CMMU_FLASH_PAGE_MODE_S))
#define DPORT_APP_CMMU_FLASH_PAGE_MODE_V  0x3
#define DPORT_APP_CMMU_FLASH_PAGE_MODE_S  9

/* DPORT_APP_CMMU_SRAM_PAGE_MODE : R/W ;bitpos:[8:6] ;default: 3'd3 ; */

#define DPORT_APP_CMMU_SRAM_PAGE_MODE  0x00000007
#define DPORT_APP_CMMU_SRAM_PAGE_MODE_M  ((DPORT_APP_CMMU_SRAM_PAGE_MODE_V)<<(DPORT_APP_CMMU_SRAM_PAGE_MODE_S))
#define DPORT_APP_CMMU_SRAM_PAGE_MODE_V  0x7
#define DPORT_APP_CMMU_SRAM_PAGE_MODE_S  6

/* DPORT_APP_CACHE_MASK_OPSDRAM : R/W ;bitpos:[5] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_MASK_OPSDRAM  (BIT(5))
#define DPORT_APP_CACHE_MASK_OPSDRAM_M  (BIT(5))
#define DPORT_APP_CACHE_MASK_OPSDRAM_V  0x1
#define DPORT_APP_CACHE_MASK_OPSDRAM_S  5

/* DPORT_APP_CACHE_MASK_DROM0 : R/W ;bitpos:[4] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_MASK_DROM0  (BIT(4))
#define DPORT_APP_CACHE_MASK_DROM0_M  (BIT(4))
#define DPORT_APP_CACHE_MASK_DROM0_V  0x1
#define DPORT_APP_CACHE_MASK_DROM0_S  4

/* DPORT_APP_CACHE_MASK_DRAM1 : R/W ;bitpos:[3] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_MASK_DRAM1  (BIT(3))
#define DPORT_APP_CACHE_MASK_DRAM1_M  (BIT(3))
#define DPORT_APP_CACHE_MASK_DRAM1_V  0x1
#define DPORT_APP_CACHE_MASK_DRAM1_S  3

/* DPORT_APP_CACHE_MASK_IROM0 : R/W ;bitpos:[2] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_MASK_IROM0  (BIT(2))
#define DPORT_APP_CACHE_MASK_IROM0_M  (BIT(2))
#define DPORT_APP_CACHE_MASK_IROM0_V  0x1
#define DPORT_APP_CACHE_MASK_IROM0_S  2

/* DPORT_APP_CACHE_MASK_IRAM1 : R/W ;bitpos:[1] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_MASK_IRAM1  (BIT(1))
#define DPORT_APP_CACHE_MASK_IRAM1_M  (BIT(1))
#define DPORT_APP_CACHE_MASK_IRAM1_V  0x1
#define DPORT_APP_CACHE_MASK_IRAM1_S  1

/* DPORT_APP_CACHE_MASK_IRAM0 : R/W ;bitpos:[0] ;default: 1'b1 ; */

#define DPORT_APP_CACHE_MASK_IRAM0  (BIT(0))
#define DPORT_APP_CACHE_MASK_IRAM0_M  (BIT(0))
#define DPORT_APP_CACHE_MASK_IRAM0_V  0x1
#define DPORT_APP_CACHE_MASK_IRAM0_S  0

#define DPORT_APP_CACHE_LOCK_0_ADDR_REG          (DR_REG_DPORT_BASE + 0x060)

/* DPORT_APP_CACHE_LOCK_0_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_0_ADDR_MAX  0x0000000F
#define DPORT_APP_CACHE_LOCK_0_ADDR_MAX_M  ((DPORT_APP_CACHE_LOCK_0_ADDR_MAX_V)<<(DPORT_APP_CACHE_LOCK_0_ADDR_MAX_S))
#define DPORT_APP_CACHE_LOCK_0_ADDR_MAX_V  0xF
#define DPORT_APP_CACHE_LOCK_0_ADDR_MAX_S  18

/* DPORT_APP_CACHE_LOCK_0_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_0_ADDR_MIN  0x0000000F
#define DPORT_APP_CACHE_LOCK_0_ADDR_MIN_M  ((DPORT_APP_CACHE_LOCK_0_ADDR_MIN_V)<<(DPORT_APP_CACHE_LOCK_0_ADDR_MIN_S))
#define DPORT_APP_CACHE_LOCK_0_ADDR_MIN_V  0xF
#define DPORT_APP_CACHE_LOCK_0_ADDR_MIN_S  14

/* DPORT_APP_CACHE_LOCK_0_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_APP_CACHE_LOCK_0_ADDR_PRE  0x00003FFF
#define DPORT_APP_CACHE_LOCK_0_ADDR_PRE_M  ((DPORT_APP_CACHE_LOCK_0_ADDR_PRE_V)<<(DPORT_APP_CACHE_LOCK_0_ADDR_PRE_S))
#define DPORT_APP_CACHE_LOCK_0_ADDR_PRE_V  0x3FFF
#define DPORT_APP_CACHE_LOCK_0_ADDR_PRE_S  0

#define DPORT_APP_CACHE_LOCK_1_ADDR_REG          (DR_REG_DPORT_BASE + 0x064)

/* DPORT_APP_CACHE_LOCK_1_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_1_ADDR_MAX  0x0000000F
#define DPORT_APP_CACHE_LOCK_1_ADDR_MAX_M  ((DPORT_APP_CACHE_LOCK_1_ADDR_MAX_V)<<(DPORT_APP_CACHE_LOCK_1_ADDR_MAX_S))
#define DPORT_APP_CACHE_LOCK_1_ADDR_MAX_V  0xF
#define DPORT_APP_CACHE_LOCK_1_ADDR_MAX_S  18

