apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_APP_CACHE_LOCK_1_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_1_ADDR_MIN  0x0000000F
#define DPORT_APP_CACHE_LOCK_1_ADDR_MIN_M  ((DPORT_APP_CACHE_LOCK_1_ADDR_MIN_V)<<(DPORT_APP_CACHE_LOCK_1_ADDR_MIN_S))
#define DPORT_APP_CACHE_LOCK_1_ADDR_MIN_V  0xF
#define DPORT_APP_CACHE_LOCK_1_ADDR_MIN_S  14

/* DPORT_APP_CACHE_LOCK_1_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_APP_CACHE_LOCK_1_ADDR_PRE  0x00003FFF
#define DPORT_APP_CACHE_LOCK_1_ADDR_PRE_M  ((DPORT_APP_CACHE_LOCK_1_ADDR_PRE_V)<<(DPORT_APP_CACHE_LOCK_1_ADDR_PRE_S))
#define DPORT_APP_CACHE_LOCK_1_ADDR_PRE_V  0x3FFF
#define DPORT_APP_CACHE_LOCK_1_ADDR_PRE_S  0

#define DPORT_APP_CACHE_LOCK_2_ADDR_REG          (DR_REG_DPORT_BASE + 0x068)

/* DPORT_APP_CACHE_LOCK_2_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_2_ADDR_MAX  0x0000000F
#define DPORT_APP_CACHE_LOCK_2_ADDR_MAX_M  ((DPORT_APP_CACHE_LOCK_2_ADDR_MAX_V)<<(DPORT_APP_CACHE_LOCK_2_ADDR_MAX_S))
#define DPORT_APP_CACHE_LOCK_2_ADDR_MAX_V  0xF
#define DPORT_APP_CACHE_LOCK_2_ADDR_MAX_S  18

/* DPORT_APP_CACHE_LOCK_2_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_2_ADDR_MIN  0x0000000F
#define DPORT_APP_CACHE_LOCK_2_ADDR_MIN_M  ((DPORT_APP_CACHE_LOCK_2_ADDR_MIN_V)<<(DPORT_APP_CACHE_LOCK_2_ADDR_MIN_S))
#define DPORT_APP_CACHE_LOCK_2_ADDR_MIN_V  0xF
#define DPORT_APP_CACHE_LOCK_2_ADDR_MIN_S  14

/* DPORT_APP_CACHE_LOCK_2_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_APP_CACHE_LOCK_2_ADDR_PRE  0x00003FFF
#define DPORT_APP_CACHE_LOCK_2_ADDR_PRE_M  ((DPORT_APP_CACHE_LOCK_2_ADDR_PRE_V)<<(DPORT_APP_CACHE_LOCK_2_ADDR_PRE_S))
#define DPORT_APP_CACHE_LOCK_2_ADDR_PRE_V  0x3FFF
#define DPORT_APP_CACHE_LOCK_2_ADDR_PRE_S  0

#define DPORT_APP_CACHE_LOCK_3_ADDR_REG          (DR_REG_DPORT_BASE + 0x06C)

/* DPORT_APP_CACHE_LOCK_3_ADDR_MAX : R/W ;bitpos:[21:18] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_3_ADDR_MAX  0x0000000F
#define DPORT_APP_CACHE_LOCK_3_ADDR_MAX_M  ((DPORT_APP_CACHE_LOCK_3_ADDR_MAX_V)<<(DPORT_APP_CACHE_LOCK_3_ADDR_MAX_S))
#define DPORT_APP_CACHE_LOCK_3_ADDR_MAX_V  0xF
#define DPORT_APP_CACHE_LOCK_3_ADDR_MAX_S  18

/* DPORT_APP_CACHE_LOCK_3_ADDR_MIN : R/W ;bitpos:[17:14] ;default: 4'h0 ; */

#define DPORT_APP_CACHE_LOCK_3_ADDR_MIN  0x0000000F
#define DPORT_APP_CACHE_LOCK_3_ADDR_MIN_M  ((DPORT_APP_CACHE_LOCK_3_ADDR_MIN_V)<<(DPORT_APP_CACHE_LOCK_3_ADDR_MIN_S))
#define DPORT_APP_CACHE_LOCK_3_ADDR_MIN_V  0xF
#define DPORT_APP_CACHE_LOCK_3_ADDR_MIN_S  14

/* DPORT_APP_CACHE_LOCK_3_ADDR_PRE : R/W ;bitpos:[13:0] ;default: 14'h0 ; */

#define DPORT_APP_CACHE_LOCK_3_ADDR_PRE  0x00003FFF
#define DPORT_APP_CACHE_LOCK_3_ADDR_PRE_M  ((DPORT_APP_CACHE_LOCK_3_ADDR_PRE_V)<<(DPORT_APP_CACHE_LOCK_3_ADDR_PRE_S))
#define DPORT_APP_CACHE_LOCK_3_ADDR_PRE_V  0x3FFF
#define DPORT_APP_CACHE_LOCK_3_ADDR_PRE_S  0

#define DPORT_TRACEMEM_MUX_MODE_REG          (DR_REG_DPORT_BASE + 0x070)

/* DPORT_TRACEMEM_MUX_MODE : R/W ;bitpos:[1:0] ;default: 2'b0 ; */

#define DPORT_TRACEMEM_MUX_MODE  0x00000003
#define DPORT_TRACEMEM_MUX_MODE_M  ((DPORT_TRACEMEM_MUX_MODE_V)<<(DPORT_TRACEMEM_MUX_MODE_S))
#define DPORT_TRACEMEM_MUX_MODE_V  0x3
#define DPORT_TRACEMEM_MUX_MODE_S  0

#define DPORT_PRO_TRACEMEM_ENA_REG          (DR_REG_DPORT_BASE + 0x074)

/* DPORT_PRO_TRACEMEM_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_PRO_TRACEMEM_ENA  (BIT(0))
#define DPORT_PRO_TRACEMEM_ENA_M  (BIT(0))
#define DPORT_PRO_TRACEMEM_ENA_V  0x1
#define DPORT_PRO_TRACEMEM_ENA_S  0

#define DPORT_APP_TRACEMEM_ENA_REG          (DR_REG_DPORT_BASE + 0x078)

/* DPORT_APP_TRACEMEM_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_APP_TRACEMEM_ENA  (BIT(0))
#define DPORT_APP_TRACEMEM_ENA_M  (BIT(0))
#define DPORT_APP_TRACEMEM_ENA_V  0x1
#define DPORT_APP_TRACEMEM_ENA_S  0

#define DPORT_CACHE_MUX_MODE_REG          (DR_REG_DPORT_BASE + 0x07C)

/* DPORT_CACHE_MUX_MODE : R/W ;bitpos:[1:0] ;default: 2'b0 ; */

#define DPORT_CACHE_MUX_MODE  0x00000003
#define DPORT_CACHE_MUX_MODE_M  ((DPORT_CACHE_MUX_MODE_V)<<(DPORT_CACHE_MUX_MODE_S))
#define DPORT_CACHE_MUX_MODE_V  0x3
#define DPORT_CACHE_MUX_MODE_S  0

#define DPORT_IMMU_PAGE_MODE_REG          (DR_REG_DPORT_BASE + 0x080)

/* DPORT_IMMU_PAGE_MODE : R/W ;bitpos:[2:1] ;default: 2'b0 ; */

#define DPORT_IMMU_PAGE_MODE  0x00000003
#define DPORT_IMMU_PAGE_MODE_M  ((DPORT_IMMU_PAGE_MODE_V)<<(DPORT_IMMU_PAGE_MODE_S))
#define DPORT_IMMU_PAGE_MODE_V  0x3
#define DPORT_IMMU_PAGE_MODE_S  1

/* DPORT_INTERNAL_SRAM_IMMU_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_INTERNAL_SRAM_IMMU_ENA  (BIT(0))
#define DPORT_INTERNAL_SRAM_IMMU_ENA_M  (BIT(0))
#define DPORT_INTERNAL_SRAM_IMMU_ENA_V  0x1
#define DPORT_INTERNAL_SRAM_IMMU_ENA_S  0

#define DPORT_DMMU_PAGE_MODE_REG          (DR_REG_DPORT_BASE + 0x084)

/* DPORT_DMMU_PAGE_MODE : R/W ;bitpos:[2:1] ;default: 2'b0 ; */

#define DPORT_DMMU_PAGE_MODE  0x00000003
#define DPORT_DMMU_PAGE_MODE_M  ((DPORT_DMMU_PAGE_MODE_V)<<(DPORT_DMMU_PAGE_MODE_S))
#define DPORT_DMMU_PAGE_MODE_V  0x3
#define DPORT_DMMU_PAGE_MODE_S  1

/* DPORT_INTERNAL_SRAM_DMMU_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_INTERNAL_SRAM_DMMU_ENA  (BIT(0))
#define DPORT_INTERNAL_SRAM_DMMU_ENA_M  (BIT(0))
#define DPORT_INTERNAL_SRAM_DMMU_ENA_V  0x1
#define DPORT_INTERNAL_SRAM_DMMU_ENA_S  0

#define DPORT_ROM_MPU_ENA_REG          (DR_REG_DPORT_BASE + 0x088)

/* DPORT_APP_ROM_MPU_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */

#define DPORT_APP_ROM_MPU_ENA  (BIT(2))
#define DPORT_APP_ROM_MPU_ENA_M  (BIT(2))
#define DPORT_APP_ROM_MPU_ENA_V  0x1
#define DPORT_APP_ROM_MPU_ENA_S  2

/* DPORT_PRO_ROM_MPU_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */

#define DPORT_PRO_ROM_MPU_ENA  (BIT(1))
#define DPORT_PRO_ROM_MPU_ENA_M  (BIT(1))
#define DPORT_PRO_ROM_MPU_ENA_V  0x1
#define DPORT_PRO_ROM_MPU_ENA_S  1

/* DPORT_SHARE_ROM_MPU_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_SHARE_ROM_MPU_ENA  (BIT(0))
#define DPORT_SHARE_ROM_MPU_ENA_M  (BIT(0))
#define DPORT_SHARE_ROM_MPU_ENA_V  0x1
#define DPORT_SHARE_ROM_MPU_ENA_S  0

