apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_AHB_LITE_MASK_APP : R/W ;bitpos:[4] ;default: 1'b0 ; */

#define DPORT_AHB_LITE_MASK_APP  (BIT(4))
#define DPORT_AHB_LITE_MASK_APP_M  (BIT(4))
#define DPORT_AHB_LITE_MASK_APP_V  0x1
#define DPORT_AHB_LITE_MASK_APP_S  4

/* DPORT_AHB_LITE_MASK_PRO : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_AHB_LITE_MASK_PRO  (BIT(0))
#define DPORT_AHB_LITE_MASK_PRO_M  (BIT(0))
#define DPORT_AHB_LITE_MASK_PRO_V  0x1
#define DPORT_AHB_LITE_MASK_PRO_S  0

#define DPORT_AHB_MPU_TABLE_0_REG          (DR_REG_DPORT_BASE + 0x0B4)

/* DPORT_AHB_ACCESS_GRANT_0 : R/W ;bitpos:[31:0] ;default: 32'hffffffff ; */

#define DPORT_AHB_ACCESS_GRANT_0  0xFFFFFFFF
#define DPORT_AHB_ACCESS_GRANT_0_M  ((DPORT_AHB_ACCESS_GRANT_0_V)<<(DPORT_AHB_ACCESS_GRANT_0_S))
#define DPORT_AHB_ACCESS_GRANT_0_V  0xFFFFFFFF
#define DPORT_AHB_ACCESS_GRANT_0_S  0

#define DPORT_AHB_MPU_TABLE_1_REG          (DR_REG_DPORT_BASE + 0x0B8)

/* DPORT_AHB_ACCESS_GRANT_1 : R/W ;bitpos:[8:0] ;default: 9'h1ff ; */

#define DPORT_AHB_ACCESS_GRANT_1  0x000001FF
#define DPORT_AHB_ACCESS_GRANT_1_M  ((DPORT_AHB_ACCESS_GRANT_1_V)<<(DPORT_AHB_ACCESS_GRANT_1_S))
#define DPORT_AHB_ACCESS_GRANT_1_V  0x1FF
#define DPORT_AHB_ACCESS_GRANT_1_S  0

#define DPORT_HOST_INF_SEL_REG          (DR_REG_DPORT_BASE + 0x0BC)

/* DPORT_LINK_DEVICE_SEL : R/W ;bitpos:[15:8] ;default: 8'h0 ; */

#define DPORT_LINK_DEVICE_SEL  0x000000FF
#define DPORT_LINK_DEVICE_SEL_M  ((DPORT_LINK_DEVICE_SEL_V)<<(DPORT_LINK_DEVICE_SEL_S))
#define DPORT_LINK_DEVICE_SEL_V  0xFF
#define DPORT_LINK_DEVICE_SEL_S  8

/* DPORT_PERI_IO_SWAP : R/W ;bitpos:[7:0] ;default: 8'h0 ; */

#define DPORT_PERI_IO_SWAP  0x000000FF
#define DPORT_PERI_IO_SWAP_M  ((DPORT_PERI_IO_SWAP_V)<<(DPORT_PERI_IO_SWAP_S))
#define DPORT_PERI_IO_SWAP_V  0xFF
#define DPORT_PERI_IO_SWAP_S  0

#define DPORT_PERIP_CLK_EN_REG          (DR_REG_DPORT_BASE + 0x0C0)

/* DPORT_PERIP_CLK_EN : R/W ;bitpos:[31:0] ;default: 32'hf9c1e06f ; */

#define DPORT_PERIP_CLK_EN  0xFFFFFFFF
#define DPORT_PERIP_CLK_EN_M  ((DPORT_PERIP_CLK_EN_V)<<(DPORT_PERIP_CLK_EN_S))
#define DPORT_PERIP_CLK_EN_V  0xFFFFFFFF
#define DPORT_PERIP_CLK_EN_S  0

#define DPORT_PWM3_CLK_EN (BIT(26))
#define DPORT_PWM2_CLK_EN (BIT(25))
#define DPORT_UART_MEM_CLK_EN   (BIT(24))
#define DPORT_UART2_CLK_EN   (BIT(23))
#define DPORT_SPI_DMA_CLK_EN   (BIT(22))
#define DPORT_I2S1_CLK_EN   (BIT(21))
#define DPORT_PWM1_CLK_EN   (BIT(20))
#define DPORT_CAN_CLK_EN   (BIT(19))
#define DPORT_I2C_EXT1_CLK_EN   (BIT(18))
#define DPORT_PWM0_CLK_EN   (BIT(17))
#define DPORT_SPI_CLK_EN   (BIT(16))
#define DPORT_TIMERGROUP1_CLK_EN   (BIT(15))
#define DPORT_EFUSE_CLK_EN   (BIT(14))
#define DPORT_TIMERGROUP_CLK_EN   (BIT(13))
#define DPORT_UHCI1_CLK_EN   (BIT(12))
#define DPORT_LEDC_CLK_EN   (BIT(11))
#define DPORT_PCNT_CLK_EN   (BIT(10))
#define DPORT_RMT_CLK_EN   (BIT(9))
#define DPORT_UHCI0_CLK_EN   (BIT(8))
#define DPORT_I2C_EXT0_CLK_EN   (BIT(7))
#define DPORT_SPI_CLK_EN_2   (BIT(6))
#define DPORT_UART1_CLK_EN   (BIT(5))
#define DPORT_I2S0_CLK_EN   (BIT(4))
#define DPORT_WDG_CLK_EN   (BIT(3))
#define DPORT_UART_CLK_EN   (BIT(2))
#define DPORT_SPI_CLK_EN_1   (BIT(1))
#define DPORT_TIMERS_CLK_EN   (BIT(0))
#define DPORT_PERIP_RST_EN_REG          (DR_REG_DPORT_BASE + 0x0C4)

/* DPORT_PERIP_RST : R/W ;bitpos:[31:0] ;default: 32'h0 ; */

#define DPORT_PERIP_RST  0xFFFFFFFF
#define DPORT_PERIP_RST_M  ((DPORT_PERIP_RST_V)<<(DPORT_PERIP_RST_S))
#define DPORT_PERIP_RST_V  0xFFFFFFFF
#define DPORT_PERIP_RST_S  0
#define DPORT_PWM3_RST (BIT(26))
#define DPORT_PWM2_RST (BIT(25))
#define DPORT_UART_MEM_RST   (BIT(24))
#define DPORT_UART2_RST   (BIT(23))
#define DPORT_SPI_DMA_RST   (BIT(22))
#define DPORT_I2S1_RST   (BIT(21))
#define DPORT_PWM1_RST   (BIT(20))
#define DPORT_CAN_RST   (BIT(19))
#define DPORT_I2C_EXT1_RST   (BIT(18))
#define DPORT_PWM0_RST   (BIT(17))
#define DPORT_SPI_RST   (BIT(16))
#define DPORT_TIMERGROUP1_RST   (BIT(15))
#define DPORT_EFUSE_RST   (BIT(14))
#define DPORT_TIMERGROUP_RST   (BIT(13))
#define DPORT_UHCI1_RST   (BIT(12))
#define DPORT_LEDC_RST   (BIT(11))
#define DPORT_PCNT_RST   (BIT(10))
#define DPORT_RMT_RST   (BIT(9))
#define DPORT_UHCI0_RST   (BIT(8))
#define DPORT_I2C_EXT0_RST   (BIT(7))
#define DPORT_SPI_RST_2   (BIT(6))
#define DPORT_UART1_RST   (BIT(5))
#define DPORT_I2S0_RST   (BIT(4))
#define DPORT_WDG_RST   (BIT(3))
#define DPORT_UART_RST   (BIT(2))
#define DPORT_SPI_RST_1   (BIT(1))
#define DPORT_TIMERS_RST   (BIT(0))
#define DPORT_SLAVE_SPI_CONFIG_REG          (DR_REG_DPORT_BASE + 0x0C8)

/* DPORT_SPI_DECRYPT_ENABLE : R/W ;bitpos:[12] ;default: 1'b0 ; */

#define DPORT_SPI_DECRYPT_ENABLE  (BIT(12))
#define DPORT_SPI_DECRYPT_ENABLE_M  (BIT(12))
#define DPORT_SPI_DECRYPT_ENABLE_V  0x1
#define DPORT_SPI_DECRYPT_ENABLE_S  12

/* DPORT_SPI_ENCRYPT_ENABLE : R/W ;bitpos:[8] ;default: 1'b0 ; */

#define DPORT_SPI_ENCRYPT_ENABLE  (BIT(8))
#define DPORT_SPI_ENCRYPT_ENABLE_M  (BIT(8))
#define DPORT_SPI_ENCRYPT_ENABLE_V  0x1
#define DPORT_SPI_ENCRYPT_ENABLE_S  8

/* DPORT_SLAVE_SPI_MASK_APP : R/W ;bitpos:[4] ;default: 1'b0 ; */

#define DPORT_SLAVE_SPI_MASK_APP  (BIT(4))
#define DPORT_SLAVE_SPI_MASK_APP_M  (BIT(4))
#define DPORT_SLAVE_SPI_MASK_APP_V  0x1
#define DPORT_SLAVE_SPI_MASK_APP_S  4

/* DPORT_SLAVE_SPI_MASK_PRO : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_SLAVE_SPI_MASK_PRO  (BIT(0))
#define DPORT_SLAVE_SPI_MASK_PRO_M  (BIT(0))
#define DPORT_SLAVE_SPI_MASK_PRO_V  0x1
#define DPORT_SLAVE_SPI_MASK_PRO_S  0

#define DPORT_WIFI_CLK_EN_REG          (DR_REG_DPORT_BASE + 0x0CC)

#define DPORT_EMAC_CLK_EN              (BIT(14))

/* DPORT_WIFI_CLK_EN : R/W ;bitpos:[31:0] ;default: 32'hfffce030 ; */

#define DPORT_WIFI_CLK_EN  0xFFFFFFFF
#define DPORT_WIFI_CLK_EN_M  ((DPORT_WIFI_CLK_EN_V)<<(DPORT_WIFI_CLK_EN_S))
#define DPORT_WIFI_CLK_EN_V  0xFFFFFFFF
#define DPORT_WIFI_CLK_EN_S  0

/* Mask for all Wifi clock bits - 1, 2, 10 */

#define DPORT_WIFI_CLK_WIFI_EN  0x00000406
#define DPORT_WIFI_CLK_WIFI_EN_M  ((DPORT_WIFI_CLK_WIFI_EN_V)<<(DPORT_WIFI_CLK_WIFI_EN_S))
#define DPORT_WIFI_CLK_WIFI_EN_V  0x406
#define DPORT_WIFI_CLK_WIFI_EN_S  0

/* Mask for all Bluetooth clock bits - 11, 16, 17 */

