apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_APP_UHCI1_INTR_MAP_REG          (DR_REG_DPORT_BASE + 0x24C)

/* DPORT_APP_UHCI1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_UHCI1_INTR_MAP  0x0000001F
#define DPORT_APP_UHCI1_INTR_MAP_M  ((DPORT_APP_UHCI1_INTR_MAP_V)<<(DPORT_APP_UHCI1_INTR_MAP_S))
#define DPORT_APP_UHCI1_INTR_MAP_V  0x1F
#define DPORT_APP_UHCI1_INTR_MAP_S  0

#define DPORT_APP_TG_T0_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x250)

/* DPORT_APP_TG_T0_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_T0_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG_T0_LEVEL_INT_MAP_M  ((DPORT_APP_TG_T0_LEVEL_INT_MAP_V)<<(DPORT_APP_TG_T0_LEVEL_INT_MAP_S))
#define DPORT_APP_TG_T0_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG_T0_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG_T1_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x254)

/* DPORT_APP_TG_T1_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_T1_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG_T1_LEVEL_INT_MAP_M  ((DPORT_APP_TG_T1_LEVEL_INT_MAP_V)<<(DPORT_APP_TG_T1_LEVEL_INT_MAP_S))
#define DPORT_APP_TG_T1_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG_T1_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG_WDT_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x258)

/* DPORT_APP_TG_WDT_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_WDT_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG_WDT_LEVEL_INT_MAP_M  ((DPORT_APP_TG_WDT_LEVEL_INT_MAP_V)<<(DPORT_APP_TG_WDT_LEVEL_INT_MAP_S))
#define DPORT_APP_TG_WDT_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG_WDT_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG_LACT_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x25C)

/* DPORT_APP_TG_LACT_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_LACT_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG_LACT_LEVEL_INT_MAP_M  ((DPORT_APP_TG_LACT_LEVEL_INT_MAP_V)<<(DPORT_APP_TG_LACT_LEVEL_INT_MAP_S))
#define DPORT_APP_TG_LACT_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG_LACT_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG1_T0_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x260)

/* DPORT_APP_TG1_T0_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_T0_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG1_T0_LEVEL_INT_MAP_M  ((DPORT_APP_TG1_T0_LEVEL_INT_MAP_V)<<(DPORT_APP_TG1_T0_LEVEL_INT_MAP_S))
#define DPORT_APP_TG1_T0_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG1_T0_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG1_T1_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x264)

/* DPORT_APP_TG1_T1_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_T1_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG1_T1_LEVEL_INT_MAP_M  ((DPORT_APP_TG1_T1_LEVEL_INT_MAP_V)<<(DPORT_APP_TG1_T1_LEVEL_INT_MAP_S))
#define DPORT_APP_TG1_T1_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG1_T1_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG1_WDT_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x268)

/* DPORT_APP_TG1_WDT_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_WDT_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG1_WDT_LEVEL_INT_MAP_M  ((DPORT_APP_TG1_WDT_LEVEL_INT_MAP_V)<<(DPORT_APP_TG1_WDT_LEVEL_INT_MAP_S))
#define DPORT_APP_TG1_WDT_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG1_WDT_LEVEL_INT_MAP_S  0

#define DPORT_APP_TG1_LACT_LEVEL_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x26C)

/* DPORT_APP_TG1_LACT_LEVEL_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_LACT_LEVEL_INT_MAP  0x0000001F
#define DPORT_APP_TG1_LACT_LEVEL_INT_MAP_M  ((DPORT_APP_TG1_LACT_LEVEL_INT_MAP_V)<<(DPORT_APP_TG1_LACT_LEVEL_INT_MAP_S))
#define DPORT_APP_TG1_LACT_LEVEL_INT_MAP_V  0x1F
#define DPORT_APP_TG1_LACT_LEVEL_INT_MAP_S  0

#define DPORT_APP_GPIO_INTERRUPT_MAP_REG          (DR_REG_DPORT_BASE + 0x270)

/* DPORT_APP_GPIO_INTERRUPT_APP_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_GPIO_INTERRUPT_APP_MAP  0x0000001F
#define DPORT_APP_GPIO_INTERRUPT_APP_MAP_M  ((DPORT_APP_GPIO_INTERRUPT_APP_MAP_V)<<(DPORT_APP_GPIO_INTERRUPT_APP_MAP_S))
#define DPORT_APP_GPIO_INTERRUPT_APP_MAP_V  0x1F
#define DPORT_APP_GPIO_INTERRUPT_APP_MAP_S  0

#define DPORT_APP_GPIO_INTERRUPT_NMI_MAP_REG          (DR_REG_DPORT_BASE + 0x274)

/* DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP: R/W ;bitpos:[4:0] ;default: 5'd16; */

#define DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP  0x0000001F
#define DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP_M  ((DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP_V)<<(DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP_S))
#define DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP_V  0x1F
#define DPORT_APP_GPIO_INTERRUPT_APP_NMI_MAP_S  0

#define DPORT_APP_CPU_INTR_FROM_CPU_0_MAP_REG          (DR_REG_DPORT_BASE + 0x278)

/* DPORT_APP_CPU_INTR_FROM_CPU_0_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_CPU_INTR_FROM_CPU_0_MAP  0x0000001F
#define DPORT_APP_CPU_INTR_FROM_CPU_0_MAP_M  ((DPORT_APP_CPU_INTR_FROM_CPU_0_MAP_V)<<(DPORT_APP_CPU_INTR_FROM_CPU_0_MAP_S))
#define DPORT_APP_CPU_INTR_FROM_CPU_0_MAP_V  0x1F
#define DPORT_APP_CPU_INTR_FROM_CPU_0_MAP_S  0

#define DPORT_APP_CPU_INTR_FROM_CPU_1_MAP_REG          (DR_REG_DPORT_BASE + 0x27C)

/* DPORT_APP_CPU_INTR_FROM_CPU_1_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_CPU_INTR_FROM_CPU_1_MAP  0x0000001F
#define DPORT_APP_CPU_INTR_FROM_CPU_1_MAP_M  ((DPORT_APP_CPU_INTR_FROM_CPU_1_MAP_V)<<(DPORT_APP_CPU_INTR_FROM_CPU_1_MAP_S))
#define DPORT_APP_CPU_INTR_FROM_CPU_1_MAP_V  0x1F
#define DPORT_APP_CPU_INTR_FROM_CPU_1_MAP_S  0

#define DPORT_APP_CPU_INTR_FROM_CPU_2_MAP_REG          (DR_REG_DPORT_BASE + 0x280)

/* DPORT_APP_CPU_INTR_FROM_CPU_2_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_CPU_INTR_FROM_CPU_2_MAP  0x0000001F
#define DPORT_APP_CPU_INTR_FROM_CPU_2_MAP_M  ((DPORT_APP_CPU_INTR_FROM_CPU_2_MAP_V)<<(DPORT_APP_CPU_INTR_FROM_CPU_2_MAP_S))
#define DPORT_APP_CPU_INTR_FROM_CPU_2_MAP_V  0x1F
#define DPORT_APP_CPU_INTR_FROM_CPU_2_MAP_S  0

#define DPORT_APP_CPU_INTR_FROM_CPU_3_MAP_REG          (DR_REG_DPORT_BASE + 0x284)

/* DPORT_APP_CPU_INTR_FROM_CPU_3_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_CPU_INTR_FROM_CPU_3_MAP  0x0000001F
#define DPORT_APP_CPU_INTR_FROM_CPU_3_MAP_M  ((DPORT_APP_CPU_INTR_FROM_CPU_3_MAP_V)<<(DPORT_APP_CPU_INTR_FROM_CPU_3_MAP_S))
#define DPORT_APP_CPU_INTR_FROM_CPU_3_MAP_V  0x1F
#define DPORT_APP_CPU_INTR_FROM_CPU_3_MAP_S  0

#define DPORT_APP_SPI_INTR_0_MAP_REG          (DR_REG_DPORT_BASE + 0x288)

/* DPORT_APP_SPI_INTR_0_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_SPI_INTR_0_MAP  0x0000001F
#define DPORT_APP_SPI_INTR_0_MAP_M  ((DPORT_APP_SPI_INTR_0_MAP_V)<<(DPORT_APP_SPI_INTR_0_MAP_S))
#define DPORT_APP_SPI_INTR_0_MAP_V  0x1F
#define DPORT_APP_SPI_INTR_0_MAP_S  0

