apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_APP_RTC_CORE_INTR_MAP  0x0000001F
#define DPORT_APP_RTC_CORE_INTR_MAP_M  ((DPORT_APP_RTC_CORE_INTR_MAP_V)<<(DPORT_APP_RTC_CORE_INTR_MAP_S))
#define DPORT_APP_RTC_CORE_INTR_MAP_V  0x1F
#define DPORT_APP_RTC_CORE_INTR_MAP_S  0

#define DPORT_APP_RMT_INTR_MAP_REG          (DR_REG_DPORT_BASE + 0x2D4)

/* DPORT_APP_RMT_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_RMT_INTR_MAP  0x0000001F
#define DPORT_APP_RMT_INTR_MAP_M  ((DPORT_APP_RMT_INTR_MAP_V)<<(DPORT_APP_RMT_INTR_MAP_S))
#define DPORT_APP_RMT_INTR_MAP_V  0x1F
#define DPORT_APP_RMT_INTR_MAP_S  0

#define DPORT_APP_PCNT_INTR_MAP_REG          (DR_REG_DPORT_BASE + 0x2D8)

/* DPORT_APP_PCNT_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_PCNT_INTR_MAP  0x0000001F
#define DPORT_APP_PCNT_INTR_MAP_M  ((DPORT_APP_PCNT_INTR_MAP_V)<<(DPORT_APP_PCNT_INTR_MAP_S))
#define DPORT_APP_PCNT_INTR_MAP_V  0x1F
#define DPORT_APP_PCNT_INTR_MAP_S  0

#define DPORT_APP_I2C_EXT0_INTR_MAP_REG          (DR_REG_DPORT_BASE + 0x2DC)

/* DPORT_APP_I2C_EXT0_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_I2C_EXT0_INTR_MAP  0x0000001F
#define DPORT_APP_I2C_EXT0_INTR_MAP_M  ((DPORT_APP_I2C_EXT0_INTR_MAP_V)<<(DPORT_APP_I2C_EXT0_INTR_MAP_S))
#define DPORT_APP_I2C_EXT0_INTR_MAP_V  0x1F
#define DPORT_APP_I2C_EXT0_INTR_MAP_S  0

#define DPORT_APP_I2C_EXT1_INTR_MAP_REG          (DR_REG_DPORT_BASE + 0x2E0)

/* DPORT_APP_I2C_EXT1_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_I2C_EXT1_INTR_MAP  0x0000001F
#define DPORT_APP_I2C_EXT1_INTR_MAP_M  ((DPORT_APP_I2C_EXT1_INTR_MAP_V)<<(DPORT_APP_I2C_EXT1_INTR_MAP_S))
#define DPORT_APP_I2C_EXT1_INTR_MAP_V  0x1F
#define DPORT_APP_I2C_EXT1_INTR_MAP_S  0

#define DPORT_APP_RSA_INTR_MAP_REG          (DR_REG_DPORT_BASE + 0x2E4)

/* DPORT_APP_RSA_INTR_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_RSA_INTR_MAP  0x0000001F
#define DPORT_APP_RSA_INTR_MAP_M  ((DPORT_APP_RSA_INTR_MAP_V)<<(DPORT_APP_RSA_INTR_MAP_S))
#define DPORT_APP_RSA_INTR_MAP_V  0x1F
#define DPORT_APP_RSA_INTR_MAP_S  0

#define DPORT_APP_SPI1_DMA_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x2E8)

/* DPORT_APP_SPI1_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_SPI1_DMA_INT_MAP  0x0000001F
#define DPORT_APP_SPI1_DMA_INT_MAP_M  ((DPORT_APP_SPI1_DMA_INT_MAP_V)<<(DPORT_APP_SPI1_DMA_INT_MAP_S))
#define DPORT_APP_SPI1_DMA_INT_MAP_V  0x1F
#define DPORT_APP_SPI1_DMA_INT_MAP_S  0

#define DPORT_APP_SPI2_DMA_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x2EC)

/* DPORT_APP_SPI2_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_SPI2_DMA_INT_MAP  0x0000001F
#define DPORT_APP_SPI2_DMA_INT_MAP_M  ((DPORT_APP_SPI2_DMA_INT_MAP_V)<<(DPORT_APP_SPI2_DMA_INT_MAP_S))
#define DPORT_APP_SPI2_DMA_INT_MAP_V  0x1F
#define DPORT_APP_SPI2_DMA_INT_MAP_S  0

#define DPORT_APP_SPI3_DMA_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x2F0)

/* DPORT_APP_SPI3_DMA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_SPI3_DMA_INT_MAP  0x0000001F
#define DPORT_APP_SPI3_DMA_INT_MAP_M  ((DPORT_APP_SPI3_DMA_INT_MAP_V)<<(DPORT_APP_SPI3_DMA_INT_MAP_S))
#define DPORT_APP_SPI3_DMA_INT_MAP_V  0x1F
#define DPORT_APP_SPI3_DMA_INT_MAP_S  0

#define DPORT_APP_WDG_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x2F4)

/* DPORT_APP_WDG_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_WDG_INT_MAP  0x0000001F
#define DPORT_APP_WDG_INT_MAP_M  ((DPORT_APP_WDG_INT_MAP_V)<<(DPORT_APP_WDG_INT_MAP_S))
#define DPORT_APP_WDG_INT_MAP_V  0x1F
#define DPORT_APP_WDG_INT_MAP_S  0

#define DPORT_APP_TIMER_INT1_MAP_REG          (DR_REG_DPORT_BASE + 0x2F8)

/* DPORT_APP_TIMER_INT1_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TIMER_INT1_MAP  0x0000001F
#define DPORT_APP_TIMER_INT1_MAP_M  ((DPORT_APP_TIMER_INT1_MAP_V)<<(DPORT_APP_TIMER_INT1_MAP_S))
#define DPORT_APP_TIMER_INT1_MAP_V  0x1F
#define DPORT_APP_TIMER_INT1_MAP_S  0

#define DPORT_APP_TIMER_INT2_MAP_REG          (DR_REG_DPORT_BASE + 0x2FC)

/* DPORT_APP_TIMER_INT2_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TIMER_INT2_MAP  0x0000001F
#define DPORT_APP_TIMER_INT2_MAP_M  ((DPORT_APP_TIMER_INT2_MAP_V)<<(DPORT_APP_TIMER_INT2_MAP_S))
#define DPORT_APP_TIMER_INT2_MAP_V  0x1F
#define DPORT_APP_TIMER_INT2_MAP_S  0

#define DPORT_APP_TG_T0_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x300)

/* DPORT_APP_TG_T0_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_T0_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG_T0_EDGE_INT_MAP_M  ((DPORT_APP_TG_T0_EDGE_INT_MAP_V)<<(DPORT_APP_TG_T0_EDGE_INT_MAP_S))
#define DPORT_APP_TG_T0_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG_T0_EDGE_INT_MAP_S  0

#define DPORT_APP_TG_T1_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x304)

/* DPORT_APP_TG_T1_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_T1_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG_T1_EDGE_INT_MAP_M  ((DPORT_APP_TG_T1_EDGE_INT_MAP_V)<<(DPORT_APP_TG_T1_EDGE_INT_MAP_S))
#define DPORT_APP_TG_T1_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG_T1_EDGE_INT_MAP_S  0

#define DPORT_APP_TG_WDT_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x308)

/* DPORT_APP_TG_WDT_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_WDT_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG_WDT_EDGE_INT_MAP_M  ((DPORT_APP_TG_WDT_EDGE_INT_MAP_V)<<(DPORT_APP_TG_WDT_EDGE_INT_MAP_S))
#define DPORT_APP_TG_WDT_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG_WDT_EDGE_INT_MAP_S  0

#define DPORT_APP_TG_LACT_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x30C)

/* DPORT_APP_TG_LACT_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG_LACT_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG_LACT_EDGE_INT_MAP_M  ((DPORT_APP_TG_LACT_EDGE_INT_MAP_V)<<(DPORT_APP_TG_LACT_EDGE_INT_MAP_S))
#define DPORT_APP_TG_LACT_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG_LACT_EDGE_INT_MAP_S  0

#define DPORT_APP_TG1_T0_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x310)

/* DPORT_APP_TG1_T0_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

