apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_APP_TG1_T0_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG1_T0_EDGE_INT_MAP_M  ((DPORT_APP_TG1_T0_EDGE_INT_MAP_V)<<(DPORT_APP_TG1_T0_EDGE_INT_MAP_S))
#define DPORT_APP_TG1_T0_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG1_T0_EDGE_INT_MAP_S  0

#define DPORT_APP_TG1_T1_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x314)

/* DPORT_APP_TG1_T1_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_T1_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG1_T1_EDGE_INT_MAP_M  ((DPORT_APP_TG1_T1_EDGE_INT_MAP_V)<<(DPORT_APP_TG1_T1_EDGE_INT_MAP_S))
#define DPORT_APP_TG1_T1_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG1_T1_EDGE_INT_MAP_S  0

#define DPORT_APP_TG1_WDT_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x318)

/* DPORT_APP_TG1_WDT_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_WDT_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG1_WDT_EDGE_INT_MAP_M  ((DPORT_APP_TG1_WDT_EDGE_INT_MAP_V)<<(DPORT_APP_TG1_WDT_EDGE_INT_MAP_S))
#define DPORT_APP_TG1_WDT_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG1_WDT_EDGE_INT_MAP_S  0

#define DPORT_APP_TG1_LACT_EDGE_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x31C)

/* DPORT_APP_TG1_LACT_EDGE_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_TG1_LACT_EDGE_INT_MAP  0x0000001F
#define DPORT_APP_TG1_LACT_EDGE_INT_MAP_M  ((DPORT_APP_TG1_LACT_EDGE_INT_MAP_V)<<(DPORT_APP_TG1_LACT_EDGE_INT_MAP_S))
#define DPORT_APP_TG1_LACT_EDGE_INT_MAP_V  0x1F
#define DPORT_APP_TG1_LACT_EDGE_INT_MAP_S  0

#define DPORT_APP_MMU_IA_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x320)

/* DPORT_APP_MMU_IA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_MMU_IA_INT_MAP  0x0000001F
#define DPORT_APP_MMU_IA_INT_MAP_M  ((DPORT_APP_MMU_IA_INT_MAP_V)<<(DPORT_APP_MMU_IA_INT_MAP_S))
#define DPORT_APP_MMU_IA_INT_MAP_V  0x1F
#define DPORT_APP_MMU_IA_INT_MAP_S  0

#define DPORT_APP_MPU_IA_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x324)

/* DPORT_APP_MPU_IA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_MPU_IA_INT_MAP  0x0000001F
#define DPORT_APP_MPU_IA_INT_MAP_M  ((DPORT_APP_MPU_IA_INT_MAP_V)<<(DPORT_APP_MPU_IA_INT_MAP_S))
#define DPORT_APP_MPU_IA_INT_MAP_V  0x1F
#define DPORT_APP_MPU_IA_INT_MAP_S  0

#define DPORT_APP_CACHE_IA_INT_MAP_REG          (DR_REG_DPORT_BASE + 0x328)

/* DPORT_APP_CACHE_IA_INT_MAP : R/W ;bitpos:[4:0] ;default: 5'd16 ; */

#define DPORT_APP_CACHE_IA_INT_MAP  0x0000001F
#define DPORT_APP_CACHE_IA_INT_MAP_M  ((DPORT_APP_CACHE_IA_INT_MAP_V)<<(DPORT_APP_CACHE_IA_INT_MAP_S))
#define DPORT_APP_CACHE_IA_INT_MAP_V  0x1F
#define DPORT_APP_CACHE_IA_INT_MAP_S  0

#define DPORT_AHBLITE_MPU_TABLE_UART_REG          (DR_REG_DPORT_BASE + 0x32C)

/* DPORT_UART_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_UART_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_UART_ACCESS_GRANT_CONFIG_M  ((DPORT_UART_ACCESS_GRANT_CONFIG_V)<<(DPORT_UART_ACCESS_GRANT_CONFIG_S))
#define DPORT_UART_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_UART_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_SPI1_REG          (DR_REG_DPORT_BASE + 0x330)

/* DPORT_SPI1_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_SPI1_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_SPI1_ACCESS_GRANT_CONFIG_M  ((DPORT_SPI1_ACCESS_GRANT_CONFIG_V)<<(DPORT_SPI1_ACCESS_GRANT_CONFIG_S))
#define DPORT_SPI1_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_SPI1_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_SPI0_REG          (DR_REG_DPORT_BASE + 0x334)

/* DPORT_SPI0_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_SPI0_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_SPI0_ACCESS_GRANT_CONFIG_M  ((DPORT_SPI0_ACCESS_GRANT_CONFIG_V)<<(DPORT_SPI0_ACCESS_GRANT_CONFIG_S))
#define DPORT_SPI0_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_SPI0_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_GPIO_REG          (DR_REG_DPORT_BASE + 0x338)

/* DPORT_GPIO_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_GPIO_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_GPIO_ACCESS_GRANT_CONFIG_M  ((DPORT_GPIO_ACCESS_GRANT_CONFIG_V)<<(DPORT_GPIO_ACCESS_GRANT_CONFIG_S))
#define DPORT_GPIO_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_GPIO_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_FE2_REG          (DR_REG_DPORT_BASE + 0x33C)

/* DPORT_FE2_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_FE2_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_FE2_ACCESS_GRANT_CONFIG_M  ((DPORT_FE2_ACCESS_GRANT_CONFIG_V)<<(DPORT_FE2_ACCESS_GRANT_CONFIG_S))
#define DPORT_FE2_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_FE2_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_FE_REG          (DR_REG_DPORT_BASE + 0x340)

/* DPORT_FE_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_FE_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_FE_ACCESS_GRANT_CONFIG_M  ((DPORT_FE_ACCESS_GRANT_CONFIG_V)<<(DPORT_FE_ACCESS_GRANT_CONFIG_S))
#define DPORT_FE_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_FE_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_TIMER_REG          (DR_REG_DPORT_BASE + 0x344)

/* DPORT_TIMER_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_TIMER_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_TIMER_ACCESS_GRANT_CONFIG_M  ((DPORT_TIMER_ACCESS_GRANT_CONFIG_V)<<(DPORT_TIMER_ACCESS_GRANT_CONFIG_S))
#define DPORT_TIMER_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_TIMER_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_RTC_REG          (DR_REG_DPORT_BASE + 0x348)

/* DPORT_RTC_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_RTC_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_RTC_ACCESS_GRANT_CONFIG_M  ((DPORT_RTC_ACCESS_GRANT_CONFIG_V)<<(DPORT_RTC_ACCESS_GRANT_CONFIG_S))
#define DPORT_RTC_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_RTC_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_IO_MUX_REG          (DR_REG_DPORT_BASE + 0x34C)

/* DPORT_IOMUX_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_IOMUX_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_IOMUX_ACCESS_GRANT_CONFIG_M  ((DPORT_IOMUX_ACCESS_GRANT_CONFIG_V)<<(DPORT_IOMUX_ACCESS_GRANT_CONFIG_S))
#define DPORT_IOMUX_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_IOMUX_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_WDG_REG          (DR_REG_DPORT_BASE + 0x350)

