apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_PWM3_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_PWM3_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_PWM3_ACCESS_GRANT_CONFIG_M  ((DPORT_PWM3_ACCESS_GRANT_CONFIG_V)<<(DPORT_PWM3_ACCESS_GRANT_CONFIG_S))
#define DPORT_PWM3_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_PWM3_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_RWBT_REG          (DR_REG_DPORT_BASE + 0x3D8)

/* DPORT_RWBT_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_RWBT_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_RWBT_ACCESS_GRANT_CONFIG_M  ((DPORT_RWBT_ACCESS_GRANT_CONFIG_V)<<(DPORT_RWBT_ACCESS_GRANT_CONFIG_S))
#define DPORT_RWBT_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_RWBT_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_BTMAC_REG          (DR_REG_DPORT_BASE + 0x3DC)

/* DPORT_BTMAC_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_BTMAC_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_BTMAC_ACCESS_GRANT_CONFIG_M  ((DPORT_BTMAC_ACCESS_GRANT_CONFIG_V)<<(DPORT_BTMAC_ACCESS_GRANT_CONFIG_S))
#define DPORT_BTMAC_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_BTMAC_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_WIFIMAC_REG          (DR_REG_DPORT_BASE + 0x3E0)

/* DPORT_WIFIMAC_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_WIFIMAC_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_WIFIMAC_ACCESS_GRANT_CONFIG_M  ((DPORT_WIFIMAC_ACCESS_GRANT_CONFIG_V)<<(DPORT_WIFIMAC_ACCESS_GRANT_CONFIG_S))
#define DPORT_WIFIMAC_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_WIFIMAC_ACCESS_GRANT_CONFIG_S  0

#define DPORT_AHBLITE_MPU_TABLE_PWR_REG          (DR_REG_DPORT_BASE + 0x3E4)

/* DPORT_PWR_ACCESS_GRANT_CONFIG : R/W ;bitpos:[5:0] ;default: 6'b0 ; */

#define DPORT_PWR_ACCESS_GRANT_CONFIG  0x0000003F
#define DPORT_PWR_ACCESS_GRANT_CONFIG_M  ((DPORT_PWR_ACCESS_GRANT_CONFIG_V)<<(DPORT_PWR_ACCESS_GRANT_CONFIG_S))
#define DPORT_PWR_ACCESS_GRANT_CONFIG_V  0x3F
#define DPORT_PWR_ACCESS_GRANT_CONFIG_S  0

#define DPORT_MEM_ACCESS_DBUG0_REG          (DR_REG_DPORT_BASE + 0x3E8)

/* DPORT_INTERNAL_SRAM_MMU_MULTI_HIT : RO ;bitpos:[29:26] ;default: 4'b0 ; */

#define DPORT_INTERNAL_SRAM_MMU_MULTI_HIT  0x0000000F
#define DPORT_INTERNAL_SRAM_MMU_MULTI_HIT_M  ((DPORT_INTERNAL_SRAM_MMU_MULTI_HIT_V)<<(DPORT_INTERNAL_SRAM_MMU_MULTI_HIT_S))
#define DPORT_INTERNAL_SRAM_MMU_MULTI_HIT_V  0xF
#define DPORT_INTERNAL_SRAM_MMU_MULTI_HIT_S  26

/* DPORT_INTERNAL_SRAM_IA : RO ;bitpos:[25:14] ;default: 12'b0 ; */

#define DPORT_INTERNAL_SRAM_IA  0x00000FFF
#define DPORT_INTERNAL_SRAM_IA_M  ((DPORT_INTERNAL_SRAM_IA_V)<<(DPORT_INTERNAL_SRAM_IA_S))
#define DPORT_INTERNAL_SRAM_IA_V  0xFFF
#define DPORT_INTERNAL_SRAM_IA_S  14

/* DPORT_INTERNAL_SRAM_MMU_AD : RO ;bitpos:[13:10] ;default: 4'b0 ; */

#define DPORT_INTERNAL_SRAM_MMU_AD  0x0000000F
#define DPORT_INTERNAL_SRAM_MMU_AD_M  ((DPORT_INTERNAL_SRAM_MMU_AD_V)<<(DPORT_INTERNAL_SRAM_MMU_AD_S))
#define DPORT_INTERNAL_SRAM_MMU_AD_V  0xF
#define DPORT_INTERNAL_SRAM_MMU_AD_S  10

/* DPORT_SHARE_ROM_IA : RO ;bitpos:[9:6] ;default: 4'b0 ; */

#define DPORT_SHARE_ROM_IA  0x0000000F
#define DPORT_SHARE_ROM_IA_M  ((DPORT_SHARE_ROM_IA_V)<<(DPORT_SHARE_ROM_IA_S))
#define DPORT_SHARE_ROM_IA_V  0xF
#define DPORT_SHARE_ROM_IA_S  6

/* DPORT_SHARE_ROM_MPU_AD : RO ;bitpos:[5:4] ;default: 2'b0 ; */

#define DPORT_SHARE_ROM_MPU_AD  0x00000003
#define DPORT_SHARE_ROM_MPU_AD_M  ((DPORT_SHARE_ROM_MPU_AD_V)<<(DPORT_SHARE_ROM_MPU_AD_S))
#define DPORT_SHARE_ROM_MPU_AD_V  0x3
#define DPORT_SHARE_ROM_MPU_AD_S  4

/* DPORT_APP_ROM_IA : RO ;bitpos:[3] ;default: 1'b0 ; */

#define DPORT_APP_ROM_IA  (BIT(3))
#define DPORT_APP_ROM_IA_M  (BIT(3))
#define DPORT_APP_ROM_IA_V  0x1
#define DPORT_APP_ROM_IA_S  3

/* DPORT_APP_ROM_MPU_AD : RO ;bitpos:[2] ;default: 1'b0 ; */

#define DPORT_APP_ROM_MPU_AD  (BIT(2))
#define DPORT_APP_ROM_MPU_AD_M  (BIT(2))
#define DPORT_APP_ROM_MPU_AD_V  0x1
#define DPORT_APP_ROM_MPU_AD_S  2

/* DPORT_PRO_ROM_IA : RO ;bitpos:[1] ;default: 1'b0 ; */

#define DPORT_PRO_ROM_IA  (BIT(1))
#define DPORT_PRO_ROM_IA_M  (BIT(1))
#define DPORT_PRO_ROM_IA_V  0x1
#define DPORT_PRO_ROM_IA_S  1

/* DPORT_PRO_ROM_MPU_AD : RO ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_PRO_ROM_MPU_AD  (BIT(0))
#define DPORT_PRO_ROM_MPU_AD_M  (BIT(0))
#define DPORT_PRO_ROM_MPU_AD_V  0x1
#define DPORT_PRO_ROM_MPU_AD_S  0

#define DPORT_MEM_ACCESS_DBUG1_REG          (DR_REG_DPORT_BASE + 0x3EC)

/* DPORT_AHBLITE_IA : RO ;bitpos:[10] ;default: 1'b0 ; */

#define DPORT_AHBLITE_IA  (BIT(10))
#define DPORT_AHBLITE_IA_M  (BIT(10))
#define DPORT_AHBLITE_IA_V  0x1
#define DPORT_AHBLITE_IA_S  10

/* DPORT_AHBLITE_ACCESS_DENY : RO ;bitpos:[9] ;default: 1'b0 ; */

#define DPORT_AHBLITE_ACCESS_DENY  (BIT(9))
#define DPORT_AHBLITE_ACCESS_DENY_M  (BIT(9))
#define DPORT_AHBLITE_ACCESS_DENY_V  0x1
#define DPORT_AHBLITE_ACCESS_DENY_S  9

/* DPORT_AHB_ACCESS_DENY : RO ;bitpos:[8] ;default: 1'b0 ; */

#define DPORT_AHB_ACCESS_DENY  (BIT(8))
#define DPORT_AHB_ACCESS_DENY_M  (BIT(8))
#define DPORT_AHB_ACCESS_DENY_V  0x1
#define DPORT_AHB_ACCESS_DENY_S  8

/* DPORT_PIDGEN_IA : RO ;bitpos:[7:6] ;default: 2'b0 ; */

#define DPORT_PIDGEN_IA  0x00000003
#define DPORT_PIDGEN_IA_M  ((DPORT_PIDGEN_IA_V)<<(DPORT_PIDGEN_IA_S))
#define DPORT_PIDGEN_IA_V  0x3
#define DPORT_PIDGEN_IA_S  6

/* DPORT_ARB_IA : RO ;bitpos:[5:4] ;default: 2'b0 ; */

#define DPORT_ARB_IA  0x00000003
#define DPORT_ARB_IA_M  ((DPORT_ARB_IA_V)<<(DPORT_ARB_IA_S))
#define DPORT_ARB_IA_V  0x3
#define DPORT_ARB_IA_S  4

/* DPORT_INTERNAL_SRAM_MMU_MISS : RO ;bitpos:[3:0] ;default: 4'b0 ; */

#define DPORT_INTERNAL_SRAM_MMU_MISS  0x0000000F
#define DPORT_INTERNAL_SRAM_MMU_MISS_M  ((DPORT_INTERNAL_SRAM_MMU_MISS_V)<<(DPORT_INTERNAL_SRAM_MMU_MISS_S))
#define DPORT_INTERNAL_SRAM_MMU_MISS_V  0xF
#define DPORT_INTERNAL_SRAM_MMU_MISS_S  0

#define DPORT_PRO_DCACHE_DBUG0_REG          (DR_REG_DPORT_BASE + 0x3F0)

/* DPORT_PRO_RX_END : RO ;bitpos:[23] ;default: 1'b0 ; */

#define DPORT_PRO_RX_END  (BIT(23))
#define DPORT_PRO_RX_END_M  (BIT(23))
#define DPORT_PRO_RX_END_V  0x1
#define DPORT_PRO_RX_END_S  23

/* DPORT_PRO_SLAVE_WDATA_V : RO ;bitpos:[22] ;default: 1'b0 ; */

#define DPORT_PRO_SLAVE_WDATA_V  (BIT(22))
#define DPORT_PRO_SLAVE_WDATA_V_M  (BIT(22))
#define DPORT_PRO_SLAVE_WDATA_V_V  0x1
#define DPORT_PRO_SLAVE_WDATA_V_S  22

/* DPORT_PRO_SLAVE_WR : RO ;bitpos:[21] ;default: 1'b0 ; */

#define DPORT_PRO_SLAVE_WR  (BIT(21))
#define DPORT_PRO_SLAVE_WR_M  (BIT(21))
#define DPORT_PRO_SLAVE_WR_V  0x1
#define DPORT_PRO_SLAVE_WR_S  21

/* DPORT_PRO_TX_END : RO ;bitpos:[20] ;default: 1'b0 ; */

#define DPORT_PRO_TX_END  (BIT(20))
#define DPORT_PRO_TX_END_M  (BIT(20))
#define DPORT_PRO_TX_END_V  0x1
#define DPORT_PRO_TX_END_S  20

/* DPORT_PRO_WR_BAK_TO_READ : RO ;bitpos:[19] ;default: 1'b0 ; */

#define DPORT_PRO_WR_BAK_TO_READ  (BIT(19))
#define DPORT_PRO_WR_BAK_TO_READ_M  (BIT(19))
#define DPORT_PRO_WR_BAK_TO_READ_V  0x1
#define DPORT_PRO_WR_BAK_TO_READ_S  19

/* DPORT_PRO_CACHE_STATE : RO ;bitpos:[18:7] ;default: 12'b0 ; */

