apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_APP_CTAG_RAM_RDATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_APP_CTAG_RAM_RDATA  0xFFFFFFFF
#define DPORT_APP_CTAG_RAM_RDATA_M  ((DPORT_APP_CTAG_RAM_RDATA_V)<<(DPORT_APP_CTAG_RAM_RDATA_S))
#define DPORT_APP_CTAG_RAM_RDATA_V  0xFFFFFFFF
#define DPORT_APP_CTAG_RAM_RDATA_S  0

#define DPORT_APP_DCACHE_DBUG2_REG          (DR_REG_DPORT_BASE + 0x420)

/* DPORT_APP_CACHE_VADDR : RO ;bitpos:[26:0] ;default: 27'b0 ; */

#define DPORT_APP_CACHE_VADDR  0x07FFFFFF
#define DPORT_APP_CACHE_VADDR_M  ((DPORT_APP_CACHE_VADDR_V)<<(DPORT_APP_CACHE_VADDR_S))
#define DPORT_APP_CACHE_VADDR_V  0x7FFFFFF
#define DPORT_APP_CACHE_VADDR_S  0

#define DPORT_APP_DCACHE_DBUG3_REG          (DR_REG_DPORT_BASE + 0x424)

/* DPORT_APP_CACHE_IRAM0_PID_ERROR : RO ;bitpos:[15] ;default: 1'b0 ; */

#define DPORT_APP_CACHE_IRAM0_PID_ERROR  (BIT(15))
#define DPORT_APP_CACHE_IRAM0_PID_ERROR_M  (BIT(15))
#define DPORT_APP_CACHE_IRAM0_PID_ERROR_V  0x1
#define DPORT_APP_CACHE_IRAM0_PID_ERROR_S  15

/* DPORT_APP_CPU_DISABLED_CACHE_IA : RO ;bitpos:[14:9] ;default: 6'b0 ; */

#define DPORT_APP_CPU_DISABLED_CACHE_IA  0x0000003F
#define DPORT_APP_CPU_DISABLED_CACHE_IA_M  ((DPORT_APP_CPU_DISABLED_CACHE_IA_V)<<(DPORT_APP_CPU_DISABLED_CACHE_IA_S))
#define DPORT_APP_CPU_DISABLED_CACHE_IA_V  0x3F
#define DPORT_APP_CPU_DISABLED_CACHE_IA_S  9

/* DPORT_APP_MMU_RDATA : RO ;bitpos:[8:0] ;default: 9'h0 ; */

#define DPORT_APP_MMU_RDATA  0x000001FF
#define DPORT_APP_MMU_RDATA_M  ((DPORT_APP_MMU_RDATA_V)<<(DPORT_APP_MMU_RDATA_S))
#define DPORT_APP_MMU_RDATA_V  0x1FF
#define DPORT_APP_MMU_RDATA_S  0

#define DPORT_APP_DCACHE_DBUG4_REG          (DR_REG_DPORT_BASE + 0x428)

/* DPORT_APP_DRAM1ADDR0_IA : RO ;bitpos:[19:0] ;default: 20'b0 ; */

#define DPORT_APP_DRAM1ADDR0_IA  0x000FFFFF
#define DPORT_APP_DRAM1ADDR0_IA_M  ((DPORT_APP_DRAM1ADDR0_IA_V)<<(DPORT_APP_DRAM1ADDR0_IA_S))
#define DPORT_APP_DRAM1ADDR0_IA_V  0xFFFFF
#define DPORT_APP_DRAM1ADDR0_IA_S  0

#define DPORT_APP_DCACHE_DBUG5_REG          (DR_REG_DPORT_BASE + 0x42C)

/* DPORT_APP_DROM0ADDR0_IA : RO ;bitpos:[19:0] ;default: 20'b0 ; */

#define DPORT_APP_DROM0ADDR0_IA  0x000FFFFF
#define DPORT_APP_DROM0ADDR0_IA_M  ((DPORT_APP_DROM0ADDR0_IA_V)<<(DPORT_APP_DROM0ADDR0_IA_S))
#define DPORT_APP_DROM0ADDR0_IA_V  0xFFFFF
#define DPORT_APP_DROM0ADDR0_IA_S  0

#define DPORT_APP_DCACHE_DBUG6_REG          (DR_REG_DPORT_BASE + 0x430)

/* DPORT_APP_IRAM0ADDR_IA : RO ;bitpos:[19:0] ;default: 20'b0 ; */

#define DPORT_APP_IRAM0ADDR_IA  0x000FFFFF
#define DPORT_APP_IRAM0ADDR_IA_M  ((DPORT_APP_IRAM0ADDR_IA_V)<<(DPORT_APP_IRAM0ADDR_IA_S))
#define DPORT_APP_IRAM0ADDR_IA_V  0xFFFFF
#define DPORT_APP_IRAM0ADDR_IA_S  0

#define DPORT_APP_DCACHE_DBUG7_REG          (DR_REG_DPORT_BASE + 0x434)

/* DPORT_APP_IRAM1ADDR_IA : RO ;bitpos:[19:0] ;default: 20'b0 ; */

#define DPORT_APP_IRAM1ADDR_IA  0x000FFFFF
#define DPORT_APP_IRAM1ADDR_IA_M  ((DPORT_APP_IRAM1ADDR_IA_V)<<(DPORT_APP_IRAM1ADDR_IA_S))
#define DPORT_APP_IRAM1ADDR_IA_V  0xFFFFF
#define DPORT_APP_IRAM1ADDR_IA_S  0

#define DPORT_APP_DCACHE_DBUG8_REG          (DR_REG_DPORT_BASE + 0x438)

/* DPORT_APP_IROM0ADDR_IA : RO ;bitpos:[19:0] ;default: 20'b0 ; */

#define DPORT_APP_IROM0ADDR_IA  0x000FFFFF
#define DPORT_APP_IROM0ADDR_IA_M  ((DPORT_APP_IROM0ADDR_IA_V)<<(DPORT_APP_IROM0ADDR_IA_S))
#define DPORT_APP_IROM0ADDR_IA_V  0xFFFFF
#define DPORT_APP_IROM0ADDR_IA_S  0

#define DPORT_APP_DCACHE_DBUG9_REG          (DR_REG_DPORT_BASE + 0x43C)

/* DPORT_APP_OPSDRAMADDR_IA : RO ;bitpos:[19:0] ;default: 20'b0 ; */

#define DPORT_APP_OPSDRAMADDR_IA  0x000FFFFF
#define DPORT_APP_OPSDRAMADDR_IA_M  ((DPORT_APP_OPSDRAMADDR_IA_V)<<(DPORT_APP_OPSDRAMADDR_IA_S))
#define DPORT_APP_OPSDRAMADDR_IA_V  0xFFFFF
#define DPORT_APP_OPSDRAMADDR_IA_S  0

#define DPORT_PRO_CPU_RECORD_CTRL_REG          (DR_REG_DPORT_BASE + 0x440)

/* DPORT_PRO_CPU_PDEBUG_ENABLE : R/W ;bitpos:[8] ;default: 1'b1 ; */

#define DPORT_PRO_CPU_PDEBUG_ENABLE  (BIT(8))
#define DPORT_PRO_CPU_PDEBUG_ENABLE_M  (BIT(8))
#define DPORT_PRO_CPU_PDEBUG_ENABLE_V  0x1
#define DPORT_PRO_CPU_PDEBUG_ENABLE_S  8

/* DPORT_PRO_CPU_RECORD_DISABLE : R/W ;bitpos:[4] ;default: 1'b0 ; */

#define DPORT_PRO_CPU_RECORD_DISABLE  (BIT(4))
#define DPORT_PRO_CPU_RECORD_DISABLE_M  (BIT(4))
#define DPORT_PRO_CPU_RECORD_DISABLE_V  0x1
#define DPORT_PRO_CPU_RECORD_DISABLE_S  4

/* DPORT_PRO_CPU_RECORD_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_PRO_CPU_RECORD_ENABLE  (BIT(0))
#define DPORT_PRO_CPU_RECORD_ENABLE_M  (BIT(0))
#define DPORT_PRO_CPU_RECORD_ENABLE_V  0x1
#define DPORT_PRO_CPU_RECORD_ENABLE_S  0

#define DPORT_PRO_CPU_RECORD_STATUS_REG          (DR_REG_DPORT_BASE + 0x444)

/* DPORT_PRO_CPU_RECORDING : RO ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_PRO_CPU_RECORDING  (BIT(0))
#define DPORT_PRO_CPU_RECORDING_M  (BIT(0))
#define DPORT_PRO_CPU_RECORDING_V  0x1
#define DPORT_PRO_CPU_RECORDING_S  0

#define DPORT_PRO_CPU_RECORD_PID_REG          (DR_REG_DPORT_BASE + 0x448)

/* DPORT_RECORD_PRO_PID : RO ;bitpos:[2:0] ;default: 3'd0 ; */

#define DPORT_RECORD_PRO_PID  0x00000007
#define DPORT_RECORD_PRO_PID_M  ((DPORT_RECORD_PRO_PID_V)<<(DPORT_RECORD_PRO_PID_S))
#define DPORT_RECORD_PRO_PID_V  0x7
#define DPORT_RECORD_PRO_PID_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGINST_REG          (DR_REG_DPORT_BASE + 0x44C)

/* DPORT_RECORD_PRO_PDEBUGINST : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGINST  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGINST_M  ((DPORT_RECORD_PRO_PDEBUGINST_V)<<(DPORT_RECORD_PRO_PDEBUGINST_S))
#define DPORT_RECORD_PRO_PDEBUGINST_V  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGINST_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGSTATUS_REG          (DR_REG_DPORT_BASE + 0x450)

/* DPORT_RECORD_PRO_PDEBUGSTATUS : RO ;bitpos:[7:0] ;default: 8'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGSTATUS  0x000000FF
#define DPORT_RECORD_PRO_PDEBUGSTATUS_M  ((DPORT_RECORD_PRO_PDEBUGSTATUS_V)<<(DPORT_RECORD_PRO_PDEBUGSTATUS_S))
#define DPORT_RECORD_PRO_PDEBUGSTATUS_V  0xFF
#define DPORT_RECORD_PRO_PDEBUGSTATUS_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGDATA_REG          (DR_REG_DPORT_BASE + 0x454)

/* DPORT_RECORD_PRO_PDEBUGDATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGDATA  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGDATA_M  ((DPORT_RECORD_PRO_PDEBUGDATA_V)<<(DPORT_RECORD_PRO_PDEBUGDATA_S))
#define DPORT_RECORD_PRO_PDEBUGDATA_V  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGDATA_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGPC_REG          (DR_REG_DPORT_BASE + 0x458)

