apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_RECORD_PRO_PDEBUGPC : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGPC  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGPC_M  ((DPORT_RECORD_PRO_PDEBUGPC_V)<<(DPORT_RECORD_PRO_PDEBUGPC_S))
#define DPORT_RECORD_PRO_PDEBUGPC_V  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGPC_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGLS0STAT_REG          (DR_REG_DPORT_BASE + 0x45C)

/* DPORT_RECORD_PRO_PDEBUGLS0STAT : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGLS0STAT  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGLS0STAT_M  ((DPORT_RECORD_PRO_PDEBUGLS0STAT_V)<<(DPORT_RECORD_PRO_PDEBUGLS0STAT_S))
#define DPORT_RECORD_PRO_PDEBUGLS0STAT_V  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGLS0STAT_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGLS0ADDR_REG          (DR_REG_DPORT_BASE + 0x460)

/* DPORT_RECORD_PRO_PDEBUGLS0ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGLS0ADDR  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGLS0ADDR_M  ((DPORT_RECORD_PRO_PDEBUGLS0ADDR_V)<<(DPORT_RECORD_PRO_PDEBUGLS0ADDR_S))
#define DPORT_RECORD_PRO_PDEBUGLS0ADDR_V  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGLS0ADDR_S  0

#define DPORT_PRO_CPU_RECORD_PDEBUGLS0DATA_REG          (DR_REG_DPORT_BASE + 0x464)

/* DPORT_RECORD_PRO_PDEBUGLS0DATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_PRO_PDEBUGLS0DATA  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGLS0DATA_M  ((DPORT_RECORD_PRO_PDEBUGLS0DATA_V)<<(DPORT_RECORD_PRO_PDEBUGLS0DATA_S))
#define DPORT_RECORD_PRO_PDEBUGLS0DATA_V  0xFFFFFFFF
#define DPORT_RECORD_PRO_PDEBUGLS0DATA_S  0

#define DPORT_APP_CPU_RECORD_CTRL_REG          (DR_REG_DPORT_BASE + 0x468)

/* DPORT_APP_CPU_PDEBUG_ENABLE : R/W ;bitpos:[8] ;default: 1'b1 ; */

#define DPORT_APP_CPU_PDEBUG_ENABLE  (BIT(8))
#define DPORT_APP_CPU_PDEBUG_ENABLE_M  (BIT(8))
#define DPORT_APP_CPU_PDEBUG_ENABLE_V  0x1
#define DPORT_APP_CPU_PDEBUG_ENABLE_S  8

/* DPORT_APP_CPU_RECORD_DISABLE : R/W ;bitpos:[4] ;default: 1'b0 ; */

#define DPORT_APP_CPU_RECORD_DISABLE  (BIT(4))
#define DPORT_APP_CPU_RECORD_DISABLE_M  (BIT(4))
#define DPORT_APP_CPU_RECORD_DISABLE_V  0x1
#define DPORT_APP_CPU_RECORD_DISABLE_S  4

/* DPORT_APP_CPU_RECORD_ENABLE : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_APP_CPU_RECORD_ENABLE  (BIT(0))
#define DPORT_APP_CPU_RECORD_ENABLE_M  (BIT(0))
#define DPORT_APP_CPU_RECORD_ENABLE_V  0x1
#define DPORT_APP_CPU_RECORD_ENABLE_S  0

#define DPORT_APP_CPU_RECORD_STATUS_REG          (DR_REG_DPORT_BASE + 0x46C)

/* DPORT_APP_CPU_RECORDING : RO ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_APP_CPU_RECORDING  (BIT(0))
#define DPORT_APP_CPU_RECORDING_M  (BIT(0))
#define DPORT_APP_CPU_RECORDING_V  0x1
#define DPORT_APP_CPU_RECORDING_S  0

#define DPORT_APP_CPU_RECORD_PID_REG          (DR_REG_DPORT_BASE + 0x470)

/* DPORT_RECORD_APP_PID : RO ;bitpos:[2:0] ;default: 3'd0 ; */

#define DPORT_RECORD_APP_PID  0x00000007
#define DPORT_RECORD_APP_PID_M  ((DPORT_RECORD_APP_PID_V)<<(DPORT_RECORD_APP_PID_S))
#define DPORT_RECORD_APP_PID_V  0x7
#define DPORT_RECORD_APP_PID_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGINST_REG          (DR_REG_DPORT_BASE + 0x474)

/* DPORT_RECORD_APP_PDEBUGINST : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_APP_PDEBUGINST  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGINST_M  ((DPORT_RECORD_APP_PDEBUGINST_V)<<(DPORT_RECORD_APP_PDEBUGINST_S))
#define DPORT_RECORD_APP_PDEBUGINST_V  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGINST_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGSTATUS_REG          (DR_REG_DPORT_BASE + 0x478)

/* DPORT_RECORD_APP_PDEBUGSTATUS : RO ;bitpos:[7:0] ;default: 8'b0 ; */

#define DPORT_RECORD_APP_PDEBUGSTATUS  0x000000FF
#define DPORT_RECORD_APP_PDEBUGSTATUS_M  ((DPORT_RECORD_APP_PDEBUGSTATUS_V)<<(DPORT_RECORD_APP_PDEBUGSTATUS_S))
#define DPORT_RECORD_APP_PDEBUGSTATUS_V  0xFF
#define DPORT_RECORD_APP_PDEBUGSTATUS_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGDATA_REG          (DR_REG_DPORT_BASE + 0x47C)

/* DPORT_RECORD_APP_PDEBUGDATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_APP_PDEBUGDATA  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGDATA_M  ((DPORT_RECORD_APP_PDEBUGDATA_V)<<(DPORT_RECORD_APP_PDEBUGDATA_S))
#define DPORT_RECORD_APP_PDEBUGDATA_V  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGDATA_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGPC_REG          (DR_REG_DPORT_BASE + 0x480)

/* DPORT_RECORD_APP_PDEBUGPC : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_APP_PDEBUGPC  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGPC_M  ((DPORT_RECORD_APP_PDEBUGPC_V)<<(DPORT_RECORD_APP_PDEBUGPC_S))
#define DPORT_RECORD_APP_PDEBUGPC_V  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGPC_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGLS0STAT_REG          (DR_REG_DPORT_BASE + 0x484)

/* DPORT_RECORD_APP_PDEBUGLS0STAT : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_APP_PDEBUGLS0STAT  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGLS0STAT_M  ((DPORT_RECORD_APP_PDEBUGLS0STAT_V)<<(DPORT_RECORD_APP_PDEBUGLS0STAT_S))
#define DPORT_RECORD_APP_PDEBUGLS0STAT_V  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGLS0STAT_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGLS0ADDR_REG          (DR_REG_DPORT_BASE + 0x488)

/* DPORT_RECORD_APP_PDEBUGLS0ADDR : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_APP_PDEBUGLS0ADDR  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGLS0ADDR_M  ((DPORT_RECORD_APP_PDEBUGLS0ADDR_V)<<(DPORT_RECORD_APP_PDEBUGLS0ADDR_S))
#define DPORT_RECORD_APP_PDEBUGLS0ADDR_V  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGLS0ADDR_S  0

#define DPORT_APP_CPU_RECORD_PDEBUGLS0DATA_REG          (DR_REG_DPORT_BASE + 0x48C)

/* DPORT_RECORD_APP_PDEBUGLS0DATA : RO ;bitpos:[31:0] ;default: 32'b0 ; */

#define DPORT_RECORD_APP_PDEBUGLS0DATA  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGLS0DATA_M  ((DPORT_RECORD_APP_PDEBUGLS0DATA_V)<<(DPORT_RECORD_APP_PDEBUGLS0DATA_S))
#define DPORT_RECORD_APP_PDEBUGLS0DATA_V  0xFFFFFFFF
#define DPORT_RECORD_APP_PDEBUGLS0DATA_S  0

#define DPORT_RSA_PD_CTRL_REG          (DR_REG_DPORT_BASE + 0x490)

/* DPORT_RSA_PD : R/W ;bitpos:[0] ;default: 1'b0 ; */

