apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_RSA_PD  (BIT(0))
#define DPORT_RSA_PD_M  (BIT(0))
#define DPORT_RSA_PD_V  0x1
#define DPORT_RSA_PD_S  0

#define DPORT_ROM_MPU_TABLE0_REG          (DR_REG_DPORT_BASE + 0x494)

/* DPORT_ROM_MPU_TABLE0 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_ROM_MPU_TABLE0  0x00000003
#define DPORT_ROM_MPU_TABLE0_M  ((DPORT_ROM_MPU_TABLE0_V)<<(DPORT_ROM_MPU_TABLE0_S))
#define DPORT_ROM_MPU_TABLE0_V  0x3
#define DPORT_ROM_MPU_TABLE0_S  0

#define DPORT_ROM_MPU_TABLE1_REG          (DR_REG_DPORT_BASE + 0x498)

/* DPORT_ROM_MPU_TABLE1 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_ROM_MPU_TABLE1  0x00000003
#define DPORT_ROM_MPU_TABLE1_M  ((DPORT_ROM_MPU_TABLE1_V)<<(DPORT_ROM_MPU_TABLE1_S))
#define DPORT_ROM_MPU_TABLE1_V  0x3
#define DPORT_ROM_MPU_TABLE1_S  0

#define DPORT_ROM_MPU_TABLE2_REG          (DR_REG_DPORT_BASE + 0x49C)

/* DPORT_ROM_MPU_TABLE2 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_ROM_MPU_TABLE2  0x00000003
#define DPORT_ROM_MPU_TABLE2_M  ((DPORT_ROM_MPU_TABLE2_V)<<(DPORT_ROM_MPU_TABLE2_S))
#define DPORT_ROM_MPU_TABLE2_V  0x3
#define DPORT_ROM_MPU_TABLE2_S  0

#define DPORT_ROM_MPU_TABLE3_REG          (DR_REG_DPORT_BASE + 0x4A0)

/* DPORT_ROM_MPU_TABLE3 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_ROM_MPU_TABLE3  0x00000003
#define DPORT_ROM_MPU_TABLE3_M  ((DPORT_ROM_MPU_TABLE3_V)<<(DPORT_ROM_MPU_TABLE3_S))
#define DPORT_ROM_MPU_TABLE3_V  0x3
#define DPORT_ROM_MPU_TABLE3_S  0

#define DPORT_SHROM_MPU_TABLE0_REG          (DR_REG_DPORT_BASE + 0x4A4)

/* DPORT_SHROM_MPU_TABLE0 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE0  0x00000003
#define DPORT_SHROM_MPU_TABLE0_M  ((DPORT_SHROM_MPU_TABLE0_V)<<(DPORT_SHROM_MPU_TABLE0_S))
#define DPORT_SHROM_MPU_TABLE0_V  0x3
#define DPORT_SHROM_MPU_TABLE0_S  0

#define DPORT_SHROM_MPU_TABLE1_REG          (DR_REG_DPORT_BASE + 0x4A8)

/* DPORT_SHROM_MPU_TABLE1 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE1  0x00000003
#define DPORT_SHROM_MPU_TABLE1_M  ((DPORT_SHROM_MPU_TABLE1_V)<<(DPORT_SHROM_MPU_TABLE1_S))
#define DPORT_SHROM_MPU_TABLE1_V  0x3
#define DPORT_SHROM_MPU_TABLE1_S  0

#define DPORT_SHROM_MPU_TABLE2_REG          (DR_REG_DPORT_BASE + 0x4AC)

/* DPORT_SHROM_MPU_TABLE2 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE2  0x00000003
#define DPORT_SHROM_MPU_TABLE2_M  ((DPORT_SHROM_MPU_TABLE2_V)<<(DPORT_SHROM_MPU_TABLE2_S))
#define DPORT_SHROM_MPU_TABLE2_V  0x3
#define DPORT_SHROM_MPU_TABLE2_S  0

#define DPORT_SHROM_MPU_TABLE3_REG          (DR_REG_DPORT_BASE + 0x4B0)

/* DPORT_SHROM_MPU_TABLE3 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE3  0x00000003
#define DPORT_SHROM_MPU_TABLE3_M  ((DPORT_SHROM_MPU_TABLE3_V)<<(DPORT_SHROM_MPU_TABLE3_S))
#define DPORT_SHROM_MPU_TABLE3_V  0x3
#define DPORT_SHROM_MPU_TABLE3_S  0

#define DPORT_SHROM_MPU_TABLE4_REG          (DR_REG_DPORT_BASE + 0x4B4)

/* DPORT_SHROM_MPU_TABLE4 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE4  0x00000003
#define DPORT_SHROM_MPU_TABLE4_M  ((DPORT_SHROM_MPU_TABLE4_V)<<(DPORT_SHROM_MPU_TABLE4_S))
#define DPORT_SHROM_MPU_TABLE4_V  0x3
#define DPORT_SHROM_MPU_TABLE4_S  0

#define DPORT_SHROM_MPU_TABLE5_REG          (DR_REG_DPORT_BASE + 0x4B8)

/* DPORT_SHROM_MPU_TABLE5 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE5  0x00000003
#define DPORT_SHROM_MPU_TABLE5_M  ((DPORT_SHROM_MPU_TABLE5_V)<<(DPORT_SHROM_MPU_TABLE5_S))
#define DPORT_SHROM_MPU_TABLE5_V  0x3
#define DPORT_SHROM_MPU_TABLE5_S  0

#define DPORT_SHROM_MPU_TABLE6_REG          (DR_REG_DPORT_BASE + 0x4BC)

/* DPORT_SHROM_MPU_TABLE6 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE6  0x00000003
#define DPORT_SHROM_MPU_TABLE6_M  ((DPORT_SHROM_MPU_TABLE6_V)<<(DPORT_SHROM_MPU_TABLE6_S))
#define DPORT_SHROM_MPU_TABLE6_V  0x3
#define DPORT_SHROM_MPU_TABLE6_S  0

#define DPORT_SHROM_MPU_TABLE7_REG          (DR_REG_DPORT_BASE + 0x4C0)

/* DPORT_SHROM_MPU_TABLE7 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE7  0x00000003
#define DPORT_SHROM_MPU_TABLE7_M  ((DPORT_SHROM_MPU_TABLE7_V)<<(DPORT_SHROM_MPU_TABLE7_S))
#define DPORT_SHROM_MPU_TABLE7_V  0x3
#define DPORT_SHROM_MPU_TABLE7_S  0

#define DPORT_SHROM_MPU_TABLE8_REG          (DR_REG_DPORT_BASE + 0x4C4)

/* DPORT_SHROM_MPU_TABLE8 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE8  0x00000003
#define DPORT_SHROM_MPU_TABLE8_M  ((DPORT_SHROM_MPU_TABLE8_V)<<(DPORT_SHROM_MPU_TABLE8_S))
#define DPORT_SHROM_MPU_TABLE8_V  0x3
#define DPORT_SHROM_MPU_TABLE8_S  0

#define DPORT_SHROM_MPU_TABLE9_REG          (DR_REG_DPORT_BASE + 0x4C8)

/* DPORT_SHROM_MPU_TABLE9 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE9  0x00000003
#define DPORT_SHROM_MPU_TABLE9_M  ((DPORT_SHROM_MPU_TABLE9_V)<<(DPORT_SHROM_MPU_TABLE9_S))
#define DPORT_SHROM_MPU_TABLE9_V  0x3
#define DPORT_SHROM_MPU_TABLE9_S  0

#define DPORT_SHROM_MPU_TABLE10_REG          (DR_REG_DPORT_BASE + 0x4CC)

/* DPORT_SHROM_MPU_TABLE10 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE10  0x00000003
#define DPORT_SHROM_MPU_TABLE10_M  ((DPORT_SHROM_MPU_TABLE10_V)<<(DPORT_SHROM_MPU_TABLE10_S))
#define DPORT_SHROM_MPU_TABLE10_V  0x3
#define DPORT_SHROM_MPU_TABLE10_S  0

#define DPORT_SHROM_MPU_TABLE11_REG          (DR_REG_DPORT_BASE + 0x4D0)

/* DPORT_SHROM_MPU_TABLE11 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE11  0x00000003
#define DPORT_SHROM_MPU_TABLE11_M  ((DPORT_SHROM_MPU_TABLE11_V)<<(DPORT_SHROM_MPU_TABLE11_S))
#define DPORT_SHROM_MPU_TABLE11_V  0x3
#define DPORT_SHROM_MPU_TABLE11_S  0

#define DPORT_SHROM_MPU_TABLE12_REG          (DR_REG_DPORT_BASE + 0x4D4)

/* DPORT_SHROM_MPU_TABLE12 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE12  0x00000003
#define DPORT_SHROM_MPU_TABLE12_M  ((DPORT_SHROM_MPU_TABLE12_V)<<(DPORT_SHROM_MPU_TABLE12_S))
#define DPORT_SHROM_MPU_TABLE12_V  0x3
#define DPORT_SHROM_MPU_TABLE12_S  0

#define DPORT_SHROM_MPU_TABLE13_REG          (DR_REG_DPORT_BASE + 0x4D8)

/* DPORT_SHROM_MPU_TABLE13 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

