apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_SHROM_MPU_TABLE13  0x00000003
#define DPORT_SHROM_MPU_TABLE13_M  ((DPORT_SHROM_MPU_TABLE13_V)<<(DPORT_SHROM_MPU_TABLE13_S))
#define DPORT_SHROM_MPU_TABLE13_V  0x3
#define DPORT_SHROM_MPU_TABLE13_S  0

#define DPORT_SHROM_MPU_TABLE14_REG          (DR_REG_DPORT_BASE + 0x4DC)

/* DPORT_SHROM_MPU_TABLE14 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE14  0x00000003
#define DPORT_SHROM_MPU_TABLE14_M  ((DPORT_SHROM_MPU_TABLE14_V)<<(DPORT_SHROM_MPU_TABLE14_S))
#define DPORT_SHROM_MPU_TABLE14_V  0x3
#define DPORT_SHROM_MPU_TABLE14_S  0

#define DPORT_SHROM_MPU_TABLE15_REG          (DR_REG_DPORT_BASE + 0x4E0)

/* DPORT_SHROM_MPU_TABLE15 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE15  0x00000003
#define DPORT_SHROM_MPU_TABLE15_M  ((DPORT_SHROM_MPU_TABLE15_V)<<(DPORT_SHROM_MPU_TABLE15_S))
#define DPORT_SHROM_MPU_TABLE15_V  0x3
#define DPORT_SHROM_MPU_TABLE15_S  0

#define DPORT_SHROM_MPU_TABLE16_REG          (DR_REG_DPORT_BASE + 0x4E4)

/* DPORT_SHROM_MPU_TABLE16 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE16  0x00000003
#define DPORT_SHROM_MPU_TABLE16_M  ((DPORT_SHROM_MPU_TABLE16_V)<<(DPORT_SHROM_MPU_TABLE16_S))
#define DPORT_SHROM_MPU_TABLE16_V  0x3
#define DPORT_SHROM_MPU_TABLE16_S  0

#define DPORT_SHROM_MPU_TABLE17_REG          (DR_REG_DPORT_BASE + 0x4E8)

/* DPORT_SHROM_MPU_TABLE17 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE17  0x00000003
#define DPORT_SHROM_MPU_TABLE17_M  ((DPORT_SHROM_MPU_TABLE17_V)<<(DPORT_SHROM_MPU_TABLE17_S))
#define DPORT_SHROM_MPU_TABLE17_V  0x3
#define DPORT_SHROM_MPU_TABLE17_S  0

#define DPORT_SHROM_MPU_TABLE18_REG          (DR_REG_DPORT_BASE + 0x4EC)

/* DPORT_SHROM_MPU_TABLE18 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE18  0x00000003
#define DPORT_SHROM_MPU_TABLE18_M  ((DPORT_SHROM_MPU_TABLE18_V)<<(DPORT_SHROM_MPU_TABLE18_S))
#define DPORT_SHROM_MPU_TABLE18_V  0x3
#define DPORT_SHROM_MPU_TABLE18_S  0

#define DPORT_SHROM_MPU_TABLE19_REG          (DR_REG_DPORT_BASE + 0x4F0)

/* DPORT_SHROM_MPU_TABLE19 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE19  0x00000003
#define DPORT_SHROM_MPU_TABLE19_M  ((DPORT_SHROM_MPU_TABLE19_V)<<(DPORT_SHROM_MPU_TABLE19_S))
#define DPORT_SHROM_MPU_TABLE19_V  0x3
#define DPORT_SHROM_MPU_TABLE19_S  0

#define DPORT_SHROM_MPU_TABLE20_REG          (DR_REG_DPORT_BASE + 0x4F4)

/* DPORT_SHROM_MPU_TABLE20 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE20  0x00000003
#define DPORT_SHROM_MPU_TABLE20_M  ((DPORT_SHROM_MPU_TABLE20_V)<<(DPORT_SHROM_MPU_TABLE20_S))
#define DPORT_SHROM_MPU_TABLE20_V  0x3
#define DPORT_SHROM_MPU_TABLE20_S  0

#define DPORT_SHROM_MPU_TABLE21_REG          (DR_REG_DPORT_BASE + 0x4F8)

/* DPORT_SHROM_MPU_TABLE21 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE21  0x00000003
#define DPORT_SHROM_MPU_TABLE21_M  ((DPORT_SHROM_MPU_TABLE21_V)<<(DPORT_SHROM_MPU_TABLE21_S))
#define DPORT_SHROM_MPU_TABLE21_V  0x3
#define DPORT_SHROM_MPU_TABLE21_S  0

#define DPORT_SHROM_MPU_TABLE22_REG          (DR_REG_DPORT_BASE + 0x4FC)

/* DPORT_SHROM_MPU_TABLE22 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE22  0x00000003
#define DPORT_SHROM_MPU_TABLE22_M  ((DPORT_SHROM_MPU_TABLE22_V)<<(DPORT_SHROM_MPU_TABLE22_S))
#define DPORT_SHROM_MPU_TABLE22_V  0x3
#define DPORT_SHROM_MPU_TABLE22_S  0

#define DPORT_SHROM_MPU_TABLE23_REG          (DR_REG_DPORT_BASE + 0x500)

/* DPORT_SHROM_MPU_TABLE23 : R/W ;bitpos:[1:0] ;default: 2'b1 ; */

#define DPORT_SHROM_MPU_TABLE23  0x00000003
#define DPORT_SHROM_MPU_TABLE23_M  ((DPORT_SHROM_MPU_TABLE23_V)<<(DPORT_SHROM_MPU_TABLE23_S))
#define DPORT_SHROM_MPU_TABLE23_V  0x3
#define DPORT_SHROM_MPU_TABLE23_S  0

#define DPORT_IMMU_TABLE0_REG          (DR_REG_DPORT_BASE + 0x504)

/* DPORT_IMMU_TABLE0 : R/W ;bitpos:[6:0] ;default: 7'd0 ; */

#define DPORT_IMMU_TABLE0  0x0000007F
#define DPORT_IMMU_TABLE0_M  ((DPORT_IMMU_TABLE0_V)<<(DPORT_IMMU_TABLE0_S))
#define DPORT_IMMU_TABLE0_V  0x7F
#define DPORT_IMMU_TABLE0_S  0

#define DPORT_IMMU_TABLE1_REG          (DR_REG_DPORT_BASE + 0x508)

/* DPORT_IMMU_TABLE1 : R/W ;bitpos:[6:0] ;default: 7'd1 ; */

#define DPORT_IMMU_TABLE1  0x0000007F
#define DPORT_IMMU_TABLE1_M  ((DPORT_IMMU_TABLE1_V)<<(DPORT_IMMU_TABLE1_S))
#define DPORT_IMMU_TABLE1_V  0x7F
#define DPORT_IMMU_TABLE1_S  0

#define DPORT_IMMU_TABLE2_REG          (DR_REG_DPORT_BASE + 0x50C)

/* DPORT_IMMU_TABLE2 : R/W ;bitpos:[6:0] ;default: 7'd2 ; */

#define DPORT_IMMU_TABLE2  0x0000007F
#define DPORT_IMMU_TABLE2_M  ((DPORT_IMMU_TABLE2_V)<<(DPORT_IMMU_TABLE2_S))
#define DPORT_IMMU_TABLE2_V  0x7F
#define DPORT_IMMU_TABLE2_S  0

#define DPORT_IMMU_TABLE3_REG          (DR_REG_DPORT_BASE + 0x510)

/* DPORT_IMMU_TABLE3 : R/W ;bitpos:[6:0] ;default: 7'd3 ; */

#define DPORT_IMMU_TABLE3  0x0000007F
#define DPORT_IMMU_TABLE3_M  ((DPORT_IMMU_TABLE3_V)<<(DPORT_IMMU_TABLE3_S))
#define DPORT_IMMU_TABLE3_V  0x7F
#define DPORT_IMMU_TABLE3_S  0

#define DPORT_IMMU_TABLE4_REG          (DR_REG_DPORT_BASE + 0x514)

/* DPORT_IMMU_TABLE4 : R/W ;bitpos:[6:0] ;default: 7'd4 ; */

#define DPORT_IMMU_TABLE4  0x0000007F
#define DPORT_IMMU_TABLE4_M  ((DPORT_IMMU_TABLE4_V)<<(DPORT_IMMU_TABLE4_S))
#define DPORT_IMMU_TABLE4_V  0x7F
#define DPORT_IMMU_TABLE4_S  0

#define DPORT_IMMU_TABLE5_REG          (DR_REG_DPORT_BASE + 0x518)

/* DPORT_IMMU_TABLE5 : R/W ;bitpos:[6:0] ;default: 7'd5 ; */

#define DPORT_IMMU_TABLE5  0x0000007F
#define DPORT_IMMU_TABLE5_M  ((DPORT_IMMU_TABLE5_V)<<(DPORT_IMMU_TABLE5_S))
#define DPORT_IMMU_TABLE5_V  0x7F
#define DPORT_IMMU_TABLE5_S  0

#define DPORT_IMMU_TABLE6_REG          (DR_REG_DPORT_BASE + 0x51C)

/* DPORT_IMMU_TABLE6 : R/W ;bitpos:[6:0] ;default: 7'd6 ; */

#define DPORT_IMMU_TABLE6  0x0000007F
#define DPORT_IMMU_TABLE6_M  ((DPORT_IMMU_TABLE6_V)<<(DPORT_IMMU_TABLE6_S))
#define DPORT_IMMU_TABLE6_V  0x7F
#define DPORT_IMMU_TABLE6_S  0

#define DPORT_IMMU_TABLE7_REG          (DR_REG_DPORT_BASE + 0x520)

