apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
/* DPORT_IMMU_TABLE7 : R/W ;bitpos:[6:0] ;default: 7'd7 ; */

#define DPORT_IMMU_TABLE7  0x0000007F
#define DPORT_IMMU_TABLE7_M  ((DPORT_IMMU_TABLE7_V)<<(DPORT_IMMU_TABLE7_S))
#define DPORT_IMMU_TABLE7_V  0x7F
#define DPORT_IMMU_TABLE7_S  0

#define DPORT_IMMU_TABLE8_REG          (DR_REG_DPORT_BASE + 0x524)

/* DPORT_IMMU_TABLE8 : R/W ;bitpos:[6:0] ;default: 7'd8 ; */

#define DPORT_IMMU_TABLE8  0x0000007F
#define DPORT_IMMU_TABLE8_M  ((DPORT_IMMU_TABLE8_V)<<(DPORT_IMMU_TABLE8_S))
#define DPORT_IMMU_TABLE8_V  0x7F
#define DPORT_IMMU_TABLE8_S  0

#define DPORT_IMMU_TABLE9_REG          (DR_REG_DPORT_BASE + 0x528)

/* DPORT_IMMU_TABLE9 : R/W ;bitpos:[6:0] ;default: 7'd9 ; */

#define DPORT_IMMU_TABLE9  0x0000007F
#define DPORT_IMMU_TABLE9_M  ((DPORT_IMMU_TABLE9_V)<<(DPORT_IMMU_TABLE9_S))
#define DPORT_IMMU_TABLE9_V  0x7F
#define DPORT_IMMU_TABLE9_S  0

#define DPORT_IMMU_TABLE10_REG          (DR_REG_DPORT_BASE + 0x52C)

/* DPORT_IMMU_TABLE10 : R/W ;bitpos:[6:0] ;default: 7'd10 ; */

#define DPORT_IMMU_TABLE10  0x0000007F
#define DPORT_IMMU_TABLE10_M  ((DPORT_IMMU_TABLE10_V)<<(DPORT_IMMU_TABLE10_S))
#define DPORT_IMMU_TABLE10_V  0x7F
#define DPORT_IMMU_TABLE10_S  0

#define DPORT_IMMU_TABLE11_REG          (DR_REG_DPORT_BASE + 0x530)

/* DPORT_IMMU_TABLE11 : R/W ;bitpos:[6:0] ;default: 7'd11 ; */

#define DPORT_IMMU_TABLE11  0x0000007F
#define DPORT_IMMU_TABLE11_M  ((DPORT_IMMU_TABLE11_V)<<(DPORT_IMMU_TABLE11_S))
#define DPORT_IMMU_TABLE11_V  0x7F
#define DPORT_IMMU_TABLE11_S  0

#define DPORT_IMMU_TABLE12_REG          (DR_REG_DPORT_BASE + 0x534)

/* DPORT_IMMU_TABLE12 : R/W ;bitpos:[6:0] ;default: 7'd12 ; */

#define DPORT_IMMU_TABLE12  0x0000007F
#define DPORT_IMMU_TABLE12_M  ((DPORT_IMMU_TABLE12_V)<<(DPORT_IMMU_TABLE12_S))
#define DPORT_IMMU_TABLE12_V  0x7F
#define DPORT_IMMU_TABLE12_S  0

#define DPORT_IMMU_TABLE13_REG          (DR_REG_DPORT_BASE + 0x538)

/* DPORT_IMMU_TABLE13 : R/W ;bitpos:[6:0] ;default: 7'd13 ; */

#define DPORT_IMMU_TABLE13  0x0000007F
#define DPORT_IMMU_TABLE13_M  ((DPORT_IMMU_TABLE13_V)<<(DPORT_IMMU_TABLE13_S))
#define DPORT_IMMU_TABLE13_V  0x7F
#define DPORT_IMMU_TABLE13_S  0

#define DPORT_IMMU_TABLE14_REG          (DR_REG_DPORT_BASE + 0x53C)

/* DPORT_IMMU_TABLE14 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */

#define DPORT_IMMU_TABLE14  0x0000007F
#define DPORT_IMMU_TABLE14_M  ((DPORT_IMMU_TABLE14_V)<<(DPORT_IMMU_TABLE14_S))
#define DPORT_IMMU_TABLE14_V  0x7F
#define DPORT_IMMU_TABLE14_S  0

#define DPORT_IMMU_TABLE15_REG          (DR_REG_DPORT_BASE + 0x540)

/* DPORT_IMMU_TABLE15 : R/W ;bitpos:[6:0] ;default: 7'd15 ; */

#define DPORT_IMMU_TABLE15  0x0000007F
#define DPORT_IMMU_TABLE15_M  ((DPORT_IMMU_TABLE15_V)<<(DPORT_IMMU_TABLE15_S))
#define DPORT_IMMU_TABLE15_V  0x7F
#define DPORT_IMMU_TABLE15_S  0

#define DPORT_DMMU_TABLE0_REG          (DR_REG_DPORT_BASE + 0x544)

/* DPORT_DMMU_TABLE0 : R/W ;bitpos:[6:0] ;default: 7'd0 ; */

#define DPORT_DMMU_TABLE0  0x0000007F
#define DPORT_DMMU_TABLE0_M  ((DPORT_DMMU_TABLE0_V)<<(DPORT_DMMU_TABLE0_S))
#define DPORT_DMMU_TABLE0_V  0x7F
#define DPORT_DMMU_TABLE0_S  0

#define DPORT_DMMU_TABLE1_REG          (DR_REG_DPORT_BASE + 0x548)

/* DPORT_DMMU_TABLE1 : R/W ;bitpos:[6:0] ;default: 7'd1 ; */

#define DPORT_DMMU_TABLE1  0x0000007F
#define DPORT_DMMU_TABLE1_M  ((DPORT_DMMU_TABLE1_V)<<(DPORT_DMMU_TABLE1_S))
#define DPORT_DMMU_TABLE1_V  0x7F
#define DPORT_DMMU_TABLE1_S  0

#define DPORT_DMMU_TABLE2_REG          (DR_REG_DPORT_BASE + 0x54C)

/* DPORT_DMMU_TABLE2 : R/W ;bitpos:[6:0] ;default: 7'd2 ; */

#define DPORT_DMMU_TABLE2  0x0000007F
#define DPORT_DMMU_TABLE2_M  ((DPORT_DMMU_TABLE2_V)<<(DPORT_DMMU_TABLE2_S))
#define DPORT_DMMU_TABLE2_V  0x7F
#define DPORT_DMMU_TABLE2_S  0

#define DPORT_DMMU_TABLE3_REG          (DR_REG_DPORT_BASE + 0x550)

/* DPORT_DMMU_TABLE3 : R/W ;bitpos:[6:0] ;default: 7'd3 ; */

#define DPORT_DMMU_TABLE3  0x0000007F
#define DPORT_DMMU_TABLE3_M  ((DPORT_DMMU_TABLE3_V)<<(DPORT_DMMU_TABLE3_S))
#define DPORT_DMMU_TABLE3_V  0x7F
#define DPORT_DMMU_TABLE3_S  0

#define DPORT_DMMU_TABLE4_REG          (DR_REG_DPORT_BASE + 0x554)

/* DPORT_DMMU_TABLE4 : R/W ;bitpos:[6:0] ;default: 7'd4 ; */

#define DPORT_DMMU_TABLE4  0x0000007F
#define DPORT_DMMU_TABLE4_M  ((DPORT_DMMU_TABLE4_V)<<(DPORT_DMMU_TABLE4_S))
#define DPORT_DMMU_TABLE4_V  0x7F
#define DPORT_DMMU_TABLE4_S  0

#define DPORT_DMMU_TABLE5_REG          (DR_REG_DPORT_BASE + 0x558)

/* DPORT_DMMU_TABLE5 : R/W ;bitpos:[6:0] ;default: 7'd5 ; */

#define DPORT_DMMU_TABLE5  0x0000007F
#define DPORT_DMMU_TABLE5_M  ((DPORT_DMMU_TABLE5_V)<<(DPORT_DMMU_TABLE5_S))
#define DPORT_DMMU_TABLE5_V  0x7F
#define DPORT_DMMU_TABLE5_S  0

#define DPORT_DMMU_TABLE6_REG          (DR_REG_DPORT_BASE + 0x55C)

/* DPORT_DMMU_TABLE6 : R/W ;bitpos:[6:0] ;default: 7'd6 ; */

#define DPORT_DMMU_TABLE6  0x0000007F
#define DPORT_DMMU_TABLE6_M  ((DPORT_DMMU_TABLE6_V)<<(DPORT_DMMU_TABLE6_S))
#define DPORT_DMMU_TABLE6_V  0x7F
#define DPORT_DMMU_TABLE6_S  0

#define DPORT_DMMU_TABLE7_REG          (DR_REG_DPORT_BASE + 0x560)

/* DPORT_DMMU_TABLE7 : R/W ;bitpos:[6:0] ;default: 7'd7 ; */

#define DPORT_DMMU_TABLE7  0x0000007F
#define DPORT_DMMU_TABLE7_M  ((DPORT_DMMU_TABLE7_V)<<(DPORT_DMMU_TABLE7_S))
#define DPORT_DMMU_TABLE7_V  0x7F
#define DPORT_DMMU_TABLE7_S  0

#define DPORT_DMMU_TABLE8_REG          (DR_REG_DPORT_BASE + 0x564)

/* DPORT_DMMU_TABLE8 : R/W ;bitpos:[6:0] ;default: 7'd8 ; */

#define DPORT_DMMU_TABLE8  0x0000007F
#define DPORT_DMMU_TABLE8_M  ((DPORT_DMMU_TABLE8_V)<<(DPORT_DMMU_TABLE8_S))
#define DPORT_DMMU_TABLE8_V  0x7F
#define DPORT_DMMU_TABLE8_S  0

#define DPORT_DMMU_TABLE9_REG          (DR_REG_DPORT_BASE + 0x568)

/* DPORT_DMMU_TABLE9 : R/W ;bitpos:[6:0] ;default: 7'd9 ; */

#define DPORT_DMMU_TABLE9  0x0000007F
#define DPORT_DMMU_TABLE9_M  ((DPORT_DMMU_TABLE9_V)<<(DPORT_DMMU_TABLE9_S))
#define DPORT_DMMU_TABLE9_V  0x7F
#define DPORT_DMMU_TABLE9_S  0

#define DPORT_DMMU_TABLE10_REG          (DR_REG_DPORT_BASE + 0x56C)

/* DPORT_DMMU_TABLE10 : R/W ;bitpos:[6:0] ;default: 7'd10 ; */

