apache/nuttx/arch/xtensa/src/esp32/hardware/esp32_dport.h
#define DPORT_DMMU_TABLE10  0x0000007F
#define DPORT_DMMU_TABLE10_M  ((DPORT_DMMU_TABLE10_V)<<(DPORT_DMMU_TABLE10_S))
#define DPORT_DMMU_TABLE10_V  0x7F
#define DPORT_DMMU_TABLE10_S  0

#define DPORT_DMMU_TABLE11_REG          (DR_REG_DPORT_BASE + 0x570)

/* DPORT_DMMU_TABLE11 : R/W ;bitpos:[6:0] ;default: 7'd11 ; */

#define DPORT_DMMU_TABLE11  0x0000007F
#define DPORT_DMMU_TABLE11_M  ((DPORT_DMMU_TABLE11_V)<<(DPORT_DMMU_TABLE11_S))
#define DPORT_DMMU_TABLE11_V  0x7F
#define DPORT_DMMU_TABLE11_S  0

#define DPORT_DMMU_TABLE12_REG          (DR_REG_DPORT_BASE + 0x574)

/* DPORT_DMMU_TABLE12 : R/W ;bitpos:[6:0] ;default: 7'd12 ; */

#define DPORT_DMMU_TABLE12  0x0000007F
#define DPORT_DMMU_TABLE12_M  ((DPORT_DMMU_TABLE12_V)<<(DPORT_DMMU_TABLE12_S))
#define DPORT_DMMU_TABLE12_V  0x7F
#define DPORT_DMMU_TABLE12_S  0

#define DPORT_DMMU_TABLE13_REG          (DR_REG_DPORT_BASE + 0x578)

/* DPORT_DMMU_TABLE13 : R/W ;bitpos:[6:0] ;default: 7'd13 ; */

#define DPORT_DMMU_TABLE13  0x0000007F
#define DPORT_DMMU_TABLE13_M  ((DPORT_DMMU_TABLE13_V)<<(DPORT_DMMU_TABLE13_S))
#define DPORT_DMMU_TABLE13_V  0x7F
#define DPORT_DMMU_TABLE13_S  0

#define DPORT_DMMU_TABLE14_REG          (DR_REG_DPORT_BASE + 0x57C)

/* DPORT_DMMU_TABLE14 : R/W ;bitpos:[6:0] ;default: 7'd14 ; */

#define DPORT_DMMU_TABLE14  0x0000007F
#define DPORT_DMMU_TABLE14_M  ((DPORT_DMMU_TABLE14_V)<<(DPORT_DMMU_TABLE14_S))
#define DPORT_DMMU_TABLE14_V  0x7F
#define DPORT_DMMU_TABLE14_S  0

#define DPORT_DMMU_TABLE15_REG          (DR_REG_DPORT_BASE + 0x580)

/* DPORT_DMMU_TABLE15 : R/W ;bitpos:[6:0] ;default: 7'd15 ; */

#define DPORT_DMMU_TABLE15  0x0000007F
#define DPORT_DMMU_TABLE15_M  ((DPORT_DMMU_TABLE15_V)<<(DPORT_DMMU_TABLE15_S))
#define DPORT_DMMU_TABLE15_V  0x7F
#define DPORT_DMMU_TABLE15_S  0

#define DPORT_PRO_INTRUSION_CTRL_REG          (DR_REG_DPORT_BASE + 0x584)

/* DPORT_PRO_INTRUSION_RECORD_RESET_N : R/W ;bitpos:[0] ;default: 1'b1 ; */

#define DPORT_PRO_INTRUSION_RECORD_RESET_N  (BIT(0))
#define DPORT_PRO_INTRUSION_RECORD_RESET_N_M  (BIT(0))
#define DPORT_PRO_INTRUSION_RECORD_RESET_N_V  0x1
#define DPORT_PRO_INTRUSION_RECORD_RESET_N_S  0

#define DPORT_PRO_INTRUSION_STATUS_REG          (DR_REG_DPORT_BASE + 0x588)

/* DPORT_PRO_INTRUSION_RECORD : RO ;bitpos:[3:0] ;default: 4'b0 ; */

#define DPORT_PRO_INTRUSION_RECORD  0x0000000F
#define DPORT_PRO_INTRUSION_RECORD_M  ((DPORT_PRO_INTRUSION_RECORD_V)<<(DPORT_PRO_INTRUSION_RECORD_S))
#define DPORT_PRO_INTRUSION_RECORD_V  0xF
#define DPORT_PRO_INTRUSION_RECORD_S  0

#define DPORT_APP_INTRUSION_CTRL_REG          (DR_REG_DPORT_BASE + 0x58C)

/* DPORT_APP_INTRUSION_RECORD_RESET_N : R/W ;bitpos:[0] ;default: 1'b1 ; */

#define DPORT_APP_INTRUSION_RECORD_RESET_N  (BIT(0))
#define DPORT_APP_INTRUSION_RECORD_RESET_N_M  (BIT(0))
#define DPORT_APP_INTRUSION_RECORD_RESET_N_V  0x1
#define DPORT_APP_INTRUSION_RECORD_RESET_N_S  0

#define DPORT_APP_INTRUSION_STATUS_REG          (DR_REG_DPORT_BASE + 0x590)

/* DPORT_APP_INTRUSION_RECORD : RO ;bitpos:[3:0] ;default: 4'b0 ; */

#define DPORT_APP_INTRUSION_RECORD  0x0000000F
#define DPORT_APP_INTRUSION_RECORD_M  ((DPORT_APP_INTRUSION_RECORD_V)<<(DPORT_APP_INTRUSION_RECORD_S))
#define DPORT_APP_INTRUSION_RECORD_V  0xF
#define DPORT_APP_INTRUSION_RECORD_S  0

#define DPORT_FRONT_END_MEM_PD_REG          (DR_REG_DPORT_BASE + 0x594)

/* DPORT_PBUS_MEM_FORCE_PD : R/W ;bitpos:[3] ;default: 1'b0 ; */

#define DPORT_PBUS_MEM_FORCE_PD  (BIT(3))
#define DPORT_PBUS_MEM_FORCE_PD_M  (BIT(3))
#define DPORT_PBUS_MEM_FORCE_PD_V  0x1
#define DPORT_PBUS_MEM_FORCE_PD_S  3

/* DPORT_PBUS_MEM_FORCE_PU : R/W ;bitpos:[2] ;default: 1'b1 ; */

#define DPORT_PBUS_MEM_FORCE_PU  (BIT(2))
#define DPORT_PBUS_MEM_FORCE_PU_M  (BIT(2))
#define DPORT_PBUS_MEM_FORCE_PU_V  0x1
#define DPORT_PBUS_MEM_FORCE_PU_S  2

/* DPORT_AGC_MEM_FORCE_PD : R/W ;bitpos:[1] ;default: 1'b0 ; */

#define DPORT_AGC_MEM_FORCE_PD  (BIT(1))
#define DPORT_AGC_MEM_FORCE_PD_M  (BIT(1))
#define DPORT_AGC_MEM_FORCE_PD_V  0x1
#define DPORT_AGC_MEM_FORCE_PD_S  1

/* DPORT_AGC_MEM_FORCE_PU : R/W ;bitpos:[0] ;default: 1'b1 ; */

#define DPORT_AGC_MEM_FORCE_PU  (BIT(0))
#define DPORT_AGC_MEM_FORCE_PU_M  (BIT(0))
#define DPORT_AGC_MEM_FORCE_PU_V  0x1
#define DPORT_AGC_MEM_FORCE_PU_S  0

#define DPORT_MMU_IA_INT_EN_REG          (DR_REG_DPORT_BASE + 0x598)

/* DPORT_MMU_IA_INT_EN : R/W ;bitpos:[23:0] ;default: 24'b0 ; */

#define DPORT_MMU_IA_INT_EN  0x00FFFFFF
#define DPORT_MMU_IA_INT_EN_M  ((DPORT_MMU_IA_INT_EN_V)<<(DPORT_MMU_IA_INT_EN_S))
#define DPORT_MMU_IA_INT_EN_V  0xFFFFFF
#define DPORT_MMU_IA_INT_EN_S  0

#define DPORT_MPU_IA_INT_EN_REG          (DR_REG_DPORT_BASE + 0x59C)

/* DPORT_MPU_IA_INT_EN : R/W ;bitpos:[16:0] ;default: 17'b0 ; */

#define DPORT_MPU_IA_INT_EN  0x0001FFFF
#define DPORT_MPU_IA_INT_EN_M  ((DPORT_MPU_IA_INT_EN_V)<<(DPORT_MPU_IA_INT_EN_S))
#define DPORT_MPU_IA_INT_EN_V  0x1FFFF
#define DPORT_MPU_IA_INT_EN_S  0

#define DPORT_CACHE_IA_INT_EN_REG          (DR_REG_DPORT_BASE + 0x5A0)

/* DPORT_CACHE_IA_INT_EN : R/W ;bitpos:[27:0] ;default: 28'b0 ; */

#define DPORT_CACHE_IA_INT_EN  0x0FFFFFFF
#define DPORT_CACHE_IA_INT_EN_M  ((DPORT_CACHE_IA_INT_EN_V)<<(DPORT_CACHE_IA_INT_EN_S))
#define DPORT_CACHE_IA_INT_EN_V  0xFFFFFFF
#define DPORT_CACHE_IA_INT_EN_S  0

#define DPORT_SECURE_BOOT_CTRL_REG          (DR_REG_DPORT_BASE + 0x5A4)

/* DPORT_SW_BOOTLOADER_SEL : R/W ;bitpos:[0] ;default: 1'b0 ; */

#define DPORT_SW_BOOTLOADER_SEL  (BIT(0))
#define DPORT_SW_BOOTLOADER_SEL_M  (BIT(0))
#define DPORT_SW_BOOTLOADER_SEL_V  0x1
#define DPORT_SW_BOOTLOADER_SEL_S  0

#define DPORT_SPI_DMA_CHAN_SEL_REG          (DR_REG_DPORT_BASE + 0x5A8)

/* DPORT_SPI3_DMA_CHAN_SEL : R/W ;bitpos:[5:4] ;default: 2'b00 ; */

#define DPORT_SPI3_DMA_CHAN_SEL  0x00000003
#define DPORT_SPI3_DMA_CHAN_SEL_M  ((DPORT_SPI3_DMA_CHAN_SEL_V)<<(DPORT_SPI3_DMA_CHAN_SEL_S))
#define DPORT_SPI3_DMA_CHAN_SEL_V  0x3
#define DPORT_SPI3_DMA_CHAN_SEL_S  4

/* DPORT_SPI2_DMA_CHAN_SEL : R/W ;bitpos:[3:2] ;default: 2'b00 ; */

#define DPORT_SPI2_DMA_CHAN_SEL  0x00000003
#define DPORT_SPI2_DMA_CHAN_SEL_M  ((DPORT_SPI2_DMA_CHAN_SEL_V)<<(DPORT_SPI2_DMA_CHAN_SEL_S))
#define DPORT_SPI2_DMA_CHAN_SEL_V  0x3
#define DPORT_SPI2_DMA_CHAN_SEL_S  2

